 {
    id: 4,
    suraKey: "hashr",
    surahNumber: 59,
    nameBangla: "আল হাশর",
    nameArabic: "الحشر",
    totalAyah: 3,
    revelation: "Madani",
    ayahs: [
      {
        ayahNumber: 22,
        arabic:
          "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ ۖ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ ۖ هُوَ الرَّحْمَٰنُ الرَّحِيمُ",
        banglaUccaron:
          "হুওয়াল্লাহুল লা যি লা ইলাহা ইল্লা হুওয়া। আলিমুল গাইবি ওয়াশ শাহাদাতি। হুওয়ার রাহমানুর রাহীম।",
        banglaMeaning:
          "তিনিই আল্লাহ। তিনি ছাড়া কোনো উপাস্য নেই। তিনি অদৃশ্য ও দৃশ্যের পরিজ্ঞাতা। তিনি পরম করুণাময়, পরম দয়াময়।",
      }
    ],
  },