export interface Ayah {
  ayahNumber: number;
  arabic: string;
  banglaUccaron: string;
  banglaMeaning: string;
}

export interface Sura {
  id: number;
  suraKey: string;
  surahNumber: number | null;
  nameBangla: string;
  nameArabic: string;
  totalAyah: number;
  revelation: "Makki" | "Madani" | "Other";
  ayahs: Ayah[];
}

export const suraList: Sura[] = [
  {
    id: 14,
    suraKey: "fatehar_ojifa",
    surahNumber: null,
    nameBangla: "ফাতেহার আজিফা",
    nameArabic: "فاتحة الوجيفة",
    totalAyah: 13,
    revelation: "Other",
    ayahs: [
      {
        ayahNumber: 1,
        arabic:
          "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُرْشِدٍ وَعَلَى آلِهِ صَلِّ عَلَى سَيِّدِنَا مُرْشِدِنَا وَبَارِكْ وَسَلِّمْ",
        banglaUccaron:
          "আল্লাহুম্মা সাল্লেআলা সাইয়্যেদেনা মোরশেদেউঁ ওয়ালায়ালে সাল্লেআলা সাইয়্যেদেনা মোরশেদেনা ওয়া বারেক ওয়া সাল্লাম। (৫ বার)",
        banglaMeaning: "",
      },
      {
        ayahNumber: 2,
        arabic:
          "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِهِ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَبَارِكْ وَسَلِّمْ",
        banglaUccaron:
          "আল্লাহুম্মা সাল্লেআলা সাইয়্যেদেনা মোহাম্মাদেউঁ ওয়ালায়ালে সাল্লেআলা সাইয়্যেদেনা মোহাম্মাদেন ওয়া বারেক ওয়া সাল্লাম। (৫ বার)",
        banglaMeaning: "",
      },
      {
        ayahNumber: 3,
        arabic:
          "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا خَوَاجَه خِضْرٍ وَعَلَى آلِهِ صَلِّ عَلَى سَيِّدِنَا خَوَاجَه خِضْرٍ وَبَارِكْ وَسَلِّمْ",
        banglaUccaron:
          "আল্লাহুম্মা সাল্লেআলা সাইয়্যেদেনা খাজা খেজের ওয়ালায়ালে সাল্লেআলা সাইয়্যেদেনা খাজা খেজের ওয়া বারেক ওয়া সাল্লাম। (৫ বার)",
        banglaMeaning: "",
      },
      {
        ayahNumber: 4,
        arabic:
          "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا خَوَاجَه شَاه أَبُو الْحَسَنِ الْجِشْتِيِّ وَعَلَى آلِهِ صَلِّ عَلَى سَيِّدِنَا خَوَاجَه شَاه أَبُو الْحَسَنِ الْجِشْتِيِّ وَبَارِكْ وَسَلِّمْ",
        banglaUccaron:
          "আল্লাহুম্মা সাল্লেআলা সাইয়্যেদেনা খাজা শাহ্ আবুল হাসান চিশ্তী ওয়ালায়ালে সাল্লেআলা সাইয়্যেদেনা খাজা শাহ্ আবুল হাসান চিশ্তী ওয়া বারেক ওয়া সাল্লাম। (৫ বার)",
        banglaMeaning: "",
      },
      {
        ayahNumber: 5,
        arabic:
          "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا خَوَاجَه غَرِيبِ نَوَازِ الْجِشْتِيِّ وَعَلَى آلِهِ صَلِّ عَلَى سَيِّدِنَا خَوَاجَه غَرِيبِ نَوَازِ الْجِشْتِيِّ وَبَارِكْ وَسَلِّمْ",
        banglaUccaron:
          "আল্লাহুম্মা সাল্লেআলা সাইয়্যেদেনা খাজা গরীব নেওয়াজ চিশ্তী ওয়ালায়ালে সাল্লেআলা সাইয়্যেদেনা খাজা গরীব নেওয়াজ চিশ্তী ওয়া বারেক ওয়া সাল্লাম। (৩ বার)",
        banglaMeaning: "",
      },
      {
        ayahNumber: 6,
        arabic:
          "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا غَوْثِ الْأَعْظَمِ دَسْتَغِيبِ وَعَلَى آلِهِ صَلِّ عَلَى سَيِّدِنَا غَوْثِ الْأَعْظَمِ دَسْتَغِيبِ وَبَارِكْ وَسَلِّمْ",
        banglaUccaron:
          "আল্লাহুম্মা সাল্লেআলা সাইয়্যেদেনা গৌছল আযম দস্তগীব ওয়ালায়ালে সাল্লেআলা সাইয়্যেদেনা গৌছল আযম দস্তগীব ওয়া বারেক ওয়া সাল্লাম। (৩ বার)",
        banglaMeaning: "",
      },
      {
        ayahNumber: 7,
        arabic:
          "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُرْتَضَى عَلِيِّ وَعَلَى آلِهِ صَلِّ عَلَى سَيِّدِنَا مُرْتَضَى عَلِيِّ وَبَارِكْ وَسَلِّمْ",
        banglaUccaron:
          "আল্লাহুম্মা সাল্লেআলা সাইয়্যেদেনা মর্তুজা আলী ওয়ালায়ালে সাল্লেআলা সাইয়্যেদেনা মর্তুজা আলী ওয়া বারেক ওয়া সাল্লাম। (৩ বার)",
        banglaMeaning: "",
      },
      {
        ayahNumber: 8,
        arabic:
          "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا تَمَامِ أَوْلِيَاءِ اللَّهِ وَعَلَى آلِهِ صَلِّ عَلَى سَيِّদِنَا تَمَامِ أَوْلِيَاءِ اللَّهِ وَبَارِكْ وَسَلِّمْ",
        banglaUccaron:
          "আল্লাহুম্মা সাল্লেআলা সাইয়্যেদেনা তামাম আউলিয়া আল্লাহ্ ওয়ালায়ালে সাল্লেআলা সাইয়্যেদেনা তামাম আউলিয়া আল্লাহ্ ওয়া বারেক ওয়া সাল্লাম। (৩ বার)",
        banglaMeaning: "",
      },
      {
        ayahNumber: 9,
        arabic: "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَاللَّهُ أَكْبَرُ",
        banglaUccaron: "সোবহান আল্লাহ্ আলহামদুলিল্লাহ্ আল্লাহু আকবার। (৯ বার)",
        banglaMeaning: "",
      },
      {
        ayahNumber: 10,
        arabic: "يَا اللَّهُ يَا رَحْمَانُ يَا رَحِيمُ",
        banglaUccaron: "ইয়া আল্লাহ্‌, ইয়া রহমান, ইয়া রহিম। (৯ বার)",
        banglaMeaning: "",
      },
      {
        ayahNumber: 11,
        arabic: "يَا رَحْمَانُ يَا كَرِيمُ يَا غَفُورُ يَا غَفَّارُ",
        banglaUccaron: "ইয়া রহমান, ইয়া করিম, ইয়া গফুর, ইয়া গাফফার। (৯ বার)",
        banglaMeaning: "",
      },
      {
        ayahNumber: 12,
        arabic: "لَا إِلَٰهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
        banglaUccaron:
          "লা-ই-লাহা ইল্লাহ্ আনতা সোবহানাকা ইন্নি কুনতু মিনাজ্জোয়ালেমিন। (৯ বার)",
        banglaMeaning: "",
      },
      {
        ayahNumber: 13,
        arabic: "التَّوَّابُ",
        banglaUccaron: "আত্তাওয়াবো। (৯ বার)",
        banglaMeaning: "",
      },
    ],
  },
];
