export interface Ayah {
  ayahNumber: number;
  arabic: string;
  banglaUccaron: string;
  banglaMeaning: string;
}

export interface Sura {
  id: number;
  suraKey: string;
  surahNumber: number | null;
  nameBangla: string;
  nameArabic: string;
  totalAyah: number;
  revelation: "Makki" | "Madani" | "Other";
  ayahs: Ayah[];
}

export const suraList: Sura[] = [

  // 🌙 Al-Muzzammil (1–19)
  {
    id: 1,
    suraKey: "muzzammil",
    surahNumber: 73,
    nameBangla: "আল মুয্যাম্মিল",
    nameArabic: "المزمل",
    totalAyah: 19,
    revelation: "Makki",
    ayahs: [
  {
    ayahNumber: 1,
    arabic: "يَٰٓأَيُّهَا ٱلْمُزَّمِّلُ",
    banglaUccaron: "ইয়াআইয়ুহাল মুঝঝাম্মিল",
    banglaMeaning: "হে বস্ত্রাবৃত!"
  },
  {
    ayahNumber: 2,
    arabic: "قُمِ ٱلَّيْلَ إِلَّا قَلِيلًا",
    banglaUccaron: "কুমিল্লাইলা ইল্লা- কালীলা",
    banglaMeaning: "রাত্রিতে দন্ডায়মান হোন কিছু অংশ বাদ দিয়ে"
  },
  {
    ayahNumber: 3,
    arabic: "نِّصْفَهُۥ مِنَ ٱلَّيْلِ أَوِ ٱنْقُصْ مِنْهُ قَلِيلًا",
    banglaUccaron: "নিসফাহূআবিনকুস মিনহু কালীলা",
    banglaMeaning: "অর্ধরাত্রি অথবা তদপেক্ষা কিছু কম"
  },
  {
    ayahNumber: 4,
    arabic: "أَوْ زِدْ عَلَيْهِ وَرَتِّلِ ٱلْقُرْءَانَ تَرْتِيلًا",
    banglaUccaron: "আও ঝিদ ‘আলাইহি ওয়া রাত্তিলিল কুরআনা তারতীলা",
    banglaMeaning: "অথবা তদপেক্ষা বেশী এবং কোরআন আবৃত্তি করুন সুবিন্যস্ত ভাবে ও স্পষ্টভাবে"
  },
  {
    ayahNumber: 5,
    arabic: "إِنَّا سَنُلْقِى عَلَيْكَ قَوْلًا ثَقِيلًا",
    banglaUccaron: "ইন্না ছানুলকী ‘আলাইকা কাওলান ছাকীলা",
    banglaMeaning: "আমি আপনার প্রতি অবতীর্ণ করেছি গুরুত্বপূর্ণ বাণী"
  },
  {
    ayahNumber: 6,
    arabic: "إِنَّ نَاشِئَةَ ٱلَّيْلِ هِىَ أَشَدُّ وَطْـًا وَأَقْوَمُ قِيلًا",
    banglaUccaron: "ইন্না না-শিআতাল্লাইলি হিয়া আশাদ্দুওয়াত‘আওঁ ওয়া আকওয়ামুকীলা",
    banglaMeaning: "নিশ্চয় এবাদতের জন্যে রাত্রিতে উঠা প্রবৃত্তি দলনে সহায়ক এবং স্পষ্ট উচ্চারণের অনুকূল"
  },
  {
    ayahNumber: 7,
    arabic: "إِنَّ لَكَ فِى ٱلنَّهَارِ سَبْحًا طَوِيلًا",
    banglaUccaron: "ইন্না লাকা ফিন্নাহারি ছাবহান তাবিলা",
    banglaMeaning: "নিশ্চয় দিবাভাগে রয়েছে আপনার দীর্ঘ কর্মব্যস্ততা"
  },
  {
    ayahNumber: 8,
    arabic: "وَٱذْكُرِ ٱسْمَ رَبِّكَ وَتَبَتَّلْ إِلَيْهِ تَبْتِيلًا",
    banglaUccaron: "ওয়াযকুরিছমা রাব্বিকা ওয়া তাবাত্তাল ইলাইহি তাবতীলা",
    banglaMeaning: "আপনি আপনার পালনকর্তার নাম স্মরণ করুন এবং একাগ্রচিত্তে তাতে মগ্ন হোন"
  },
  {
    ayahNumber: 9,
    arabic: "رَبُّ ٱلْمَشْرِقِ وَٱلْمَغْرِبِ لَآ إِلَٰهَ إِلَّا هُوَ فَٱتَّخِذْهُ وَكِيلًا",
    banglaUccaron: "রাব্বুল মাশরিকিওয়াল মাগরিবি লাইলাহা ইল্লাহুওয়া ফাত্তাখিযহু ওয়াকীলা",
    banglaMeaning: "তিনি পূর্ব ও পশ্চিমের অধিকর্তা। তিনি ব্যতীত কোন উপাস্য নেই। অতএব, তাঁকেই গ্রহণ করুন কর্মবিধায়করূপে"
  },
  {
    ayahNumber: 10,
    arabic: "وَٱصْبِرْ عَلَىٰ مَا يَقُولُونَ وَٱهْجُرْهُمْ هَجْرًا جَمِيلًا",
    banglaUccaron: "ওয়াসবির ‘আলামাইয়াকূলূনা ওয়াহজুরহুম হাজরান জামীলা",
    banglaMeaning: "কাফেররা যা বলে তজ্জন্যে আপনি সবর করুন এবং সুন্দরভাবে তাদেরকে পরিহার করে চলুন"
  },
  {
    ayahNumber: 11,
    arabic: "وَذَرْنِى وَٱلْمُكَذِّبِينَ أُو۟لِى ٱلنَّعْمَةِ وَمَهِّلْهُمْ قَلِيلًا",
    banglaUccaron: "ওয়া যারনী ওয়াল মুকাযযিবীনা উলিন না‘মাতি ওয়া মাহহিলহুম কালীলা",
    banglaMeaning: "বিত্ত-বৈভবের অধিকারী মিথ্যারোপকারীদেরকে আমার হাতে ছেড়ে দিন এবং তাদেরকে কিছু অবকাশ দিন"
  },
  {
    ayahNumber: 12,
    arabic: "إِنَّ لَدَيْنَآ أَنكَالًا وَجَحِيمًا",
    banglaUccaron: "ইন্না লাদাইনাআনকালাওঁ ওয়া জাহীমা",
    banglaMeaning: "নিশ্চয় আমার কাছে আছে শিকল ও অগ্নিকুন্ড"
  },
  {
    ayahNumber: 13,
    arabic: "وَطَعَامًا ذَا غُصَّةٍ وَعَذَابًا أَلِيمًا",
    banglaUccaron: "ওয়া তা‘আমান যাগুসসাতিওঁ ওয়া‘আযাবান আলীমা",
    banglaMeaning: "গলগ্রহ হয়ে যায় এমন খাদ্য এবং যন্ত্রণাদায়ক শাস্তি"
  },
  {
    ayahNumber: 14,
    arabic: "يَوْمَ تَرْجُفُ ٱلْأَرْضُ وَٱلْجِبَالُ وَكَانَتِ ٱلْجِبَالُ كَثِيبًا مَّهِيلًا",
    banglaUccaron: "ইয়াওমা তারজুফুল আরদুওয়ালজিবালুওয়াকানাতিল জিবালুকাছীবাম মাহীলা",
    banglaMeaning: "যেদিন পৃথিবী পর্বতমালা প্রকম্পিত হবে এবং পর্বতসমূহ হয়ে যাবে বহমান বালুকাস্তুপ"
  },
  {
    ayahNumber: 15,
    arabic: "إِنَّآ أَرْسَلْنَآ إِلَيْكُمْ رَسُولًا شَٰهِدًا عَلَيْكُمْ كَمَآ أَرْسَلْنَآ إِلَىٰ فِرْعَوْنَ رَسُولًا",
    banglaUccaron: "ইন্নাআরছালনাইলাইকুম রাছূলান শাহিদান ‘আলাইকুম কামাআরছালনাইলাফিরআওনা রাছূলা",
    banglaMeaning: "আমি তোমাদের কাছে একজন রসূলকে তোমাদের জন্যে সাক্ষী করে প্রেরণ করেছি, যেমন প্রেরণ করেছিলাম ফেরাউনের কাছে একজন রসূল"
  },
  {
    ayahNumber: 16,
    arabic: "فَعَصَىٰ فِرْعَوْنُ ٱلرَّسُولَ فَأَخَذْنَٰهُ أَخْذًا وَبِيلًا",
    banglaUccaron: "ফা‘আসাফিরআওনুর রাছূলা ফাআখাযনাহু আখযাওঁ ওয়া বীলা",
    banglaMeaning: "অতঃপর ফেরাউন সেই রসূলকে অমান্য করল, ফলে আমি তাকে কঠিন শাস্তি দিয়েছি"
  },
  {
    ayahNumber: 17,
    arabic: "فَكَيْفَ تَتَّقُونَ إِن كَفَرْتُمْ يَوْمًا يَجْعَلُ ٱلْوِلْدَٰنَ شِيبًا",
    banglaUccaron: "ফাকাইফা তাত্তাকূনা ইন কাফারতুম ইয়াওমাইঁ ইয়াজআলুল বিলদানা শীবা",
    banglaMeaning: "অতএব, তোমরা কিরূপে আত্নরক্ষা করবে যদি তোমরা সেদিনকে অস্বীকার কর, যেদিন বালককে করে দিব বৃদ্ধ"
  },
  {
    ayahNumber: 18,
    arabic: "ٱلسَّمَآءُ مُنفَطِرٌۢ بِهِۦ كَانَ وَعْدُهُۥ مَفْعُولًا",
    banglaUccaron: "আছছামাউ মুনফাতিরুম বিহী কানা ওয়া‘দুহূ মাফঊলা",
    banglaMeaning: "সেদিন আকাশ বিদীর্ণ হবে। তার প্রতিশ্রুতি অবশ্যই বাস্তবায়িত হবে"
  },
  {
    ayahNumber: 19,
    arabic: "إِنَّ هَٰذِهِۦ تَذْكِرَةٌ فَمَن شَآءَ ٱتَّخَذَ إِلَىٰ رَبِّهِۦ سَبِيلًا",
    banglaUccaron: "ইন্না হাযিহী তাযকিরাতুন ফামান শাআ ত্তাখাযা ইলারাব্বিহী ছাবীলা",
    banglaMeaning: "এটা উপদেশ। অতএব, যার ইচ্ছা সে তার পালনকর্তার দিকে পথ অবলম্বন করুক"
  }
],
  },

  // 🌿 Yasin (1–12)
  {
    id: 2,
    suraKey: "yasin",
    surahNumber: 36,
    nameBangla: "ইয়া-সীন",
    nameArabic: "يس",
    totalAyah: 12,
    revelation: "Makki",
    ayahs: [
  {
    ayahNumber: 1,
    arabic: "يسٓ",
    banglaUccaron: "ইয়া-ছীন।",
    banglaMeaning: "ইয়া-সীন।"
  },
  {
    ayahNumber: 2,
    arabic: "وَٱلْقُرْءَانِ ٱلْحَكِيمِ",
    banglaUccaron: "ওয়াল কুরআ-নিল হাকীম।",
    banglaMeaning: "প্রজ্ঞাময় কোরআনের কসম।"
  },
  {
    ayahNumber: 3,
    arabic: "إِنَّكَ لَمِنَ ٱلْمُرْسَلِينَ",
    banglaUccaron: "ইন্নাকা লামিনাল মুরছালীন।",
    banglaMeaning: "নিশ্চয় আপনি প্রেরিত রসূলগণের একজন।"
  },
  {
    ayahNumber: 4,
    arabic: "عَلَىٰ صِرَٰطٍ مُّسْتَقِيمٍ",
    banglaUccaron: "‘আলা-সিরাতিম মুছতাকীম।",
    banglaMeaning: "সরল পথে প্রতিষ্ঠিত।"
  },
  {
    ayahNumber: 5,
    arabic: "تَنزِيلَ ٱلْعَزِيزِ ٱلرَّحِيمِ",
    banglaUccaron: "তানঝীলাল ‘আঝীঝির রাহীম।",
    banglaMeaning: "কোরআন পরাক্রমশালী পরম দয়ালু আল্লাহর তরফ থেকে অবতীর্ণ।"
  },
  {
    ayahNumber: 6,
    arabic: "لِتُنذِرَ قَوْمًا مَّآ أُنذِرَ ءَابَآؤُهُمْ فَهُمْ غَٰفِلُونَ",
    banglaUccaron: "লিতুনযিরা কাওমাম্মাউনযিরা আ-বাউহুম ফাহুম গা-ফিলূন।",
    banglaMeaning: "যাতে আপনি এমন এক জাতিকে সতর্ক করেন, যাদের পূর্ব পুরুষগণকেও সতর্ক করা হয়নি। ফলে তারা গাফেল।"
  },
  {
    ayahNumber: 7,
    arabic: "لَقَدْ حَقَّ ٱلْقَوْلُ عَلَىٰٓ أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ",
    banglaUccaron: "লাকাদ হাক্কাল কাওলু‘আলাআকছারিহিম ফাহুম লা-ইউ’মিনূন।",
    banglaMeaning: "তাদের অধিকাংশের জন্যে শাস্তির বিষয় অবধারিত হয়েছে। সুতরাং তারা বিশ্বাস স্থাপন করবে না।"
  },
  {
    ayahNumber: 8,
    arabic: "إِنَّا جَعَلْنَا فِىٓ أَعْنَٰقِهِمْ أَغْلَٰلًا فَهِىَ إِلَى ٱلْأَذْقَانِ فَهُم مُّقْمَحُونَ",
    banglaUccaron: "ইন্না- জা‘আলনা-ফী আ‘না-কিহিম আগলা-লান ফাহিয়া ইলাল আযকা-নি ফাহুম মুকমাহূন।",
    banglaMeaning: "আমি তাদের গর্দানে চিবুক পর্যন্ত বেড়ী পরিয়েছি। ফলে তাদের মস্তক উর্দ্ধমুখী হয়ে গেছে।"
  },
  {
    ayahNumber: 9,
    arabic: "وَجَعَلْنَا مِنۢ بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَٰهُمْ فَهُمْ لَا يُبْصِرُونَ",
    banglaUccaron: "ওয়া জা‘আল না-মিম বাইনি আইদীহিম ছাদ্দাওঁ ওয়া মিন খালফিহিম ছাদ্দান ফাআগশাইনা-হুম ফাহুম লা-ইউবসিরূন।",
    banglaMeaning: "আমি তাদের সামনে ও পিছনে প্রাচীর স্থাপন করেছি, অতঃপর তাদেরকে আবৃত করে দিয়েছি, ফলে তারা দেখে না।"
  },
  {
    ayahNumber: 10,
    arabic: "وَسَوَآءٌ عَلَيْهِمْ ءَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ",
    banglaUccaron: "ওয়া ছাওয়াউন ‘আলাইহিম আ আনযারতাহুম আম লাম তুনযিরহুম লা-ইউ’মিনূন।",
    banglaMeaning: "আপনি তাদেরকে সতর্ক করুন বা না করুন, তাদের পক্ষে দুয়েই সমান; তারা বিশ্বাস স্থাপন করবে না।"
  },
  {
    ayahNumber: 11,
    arabic: "إِنَّمَا تُنذِرُ مَنِ ٱتَّبَعَ ٱلذِّكْرَ وَخَشِىَ ٱلرَّحْمَٰنَ بِٱلْغَيْبِ فَبَشِّرْهُ بِمَغْفِرَةٍ وَأَجْرٍ كَرِيمٍ",
    banglaUccaron: "ইন্নামা-তুনযিরু মানিত্তাবা‘আযযিকরা ওয়া খাশিয়াররাহমা-না বিলগাইবি ফাবাশশিরহু বিমাগফিরাতিওঁ ওয়া আজরিন কারীম।",
    banglaMeaning: "আপনি কেবল তাদেরকেই সতর্ক করতে পারেন, যারা উপদেশ অনুসরণ করে এবং দয়াময় আল্লাহকে না দেখে ভয় করে। অতএব আপনি তাদেরকে সুসংবাদ দিয়ে দিন ক্ষমা ও সম্মানজনক পুরস্কারের।"
  },
  {
    ayahNumber: 12,
    arabic: "إِنَّا نَحْنُ نُحْىِي ٱلْمَوْتَىٰ وَنَكْتُبُ مَا قَدَّمُوا۟ وَءَاثَٰرَهُمْ ۚ وَكُلَّ شَىْءٍ أَحْصَيْنَٰهُ فِىٓ إِمَامٍ مُّبِينٍ",
    banglaUccaron: "ইন্না-নাহনুনুহয়িল মাওতা-ওয়া নাকতুবুমা-কাদ্দামূওয়া আ-ছা-রাহুম ওয়া কুল্লা শাইয়িন আহসাইনা-হু ফীইমা-মিম মুবীন।",
    banglaMeaning: "আমিই মৃতদেরকে জীবিত করি এবং তাদের কর্ম ও কীর্তিসমূহ লিপিবদ্ধ করি। আমি প্রত্যেক বস্তু স্পষ্ট কিতাবে সংরক্ষিত রেখেছি।"
  }
]

  },

  // 🌺 Ar-Rahman (1–27)
  {
    id: 3,
    suraKey: "rahman",
    surahNumber: 55,
    nameBangla: "আর রহমান",
    nameArabic: "الرحمن",
    totalAyah: 27,
    revelation: "Madani",
    ayahs: [
  {
    ayahNumber: 1,
    arabic: "الرَّحْمَٰنُ",
    banglaUccaron: "আর-রাহমান",
    banglaMeaning: "পরম করুণাময়।"
  },
  {
    ayahNumber: 2,
    arabic: "عَلَّمَ الْقُرْءَانَ",
    banglaUccaron: "আল্লামাল কুরআন",
    banglaMeaning: "তিনি কুরআন শিক্ষা দিয়েছেন।"
  },
  {
    ayahNumber: 3,
    arabic: "خَلَقَ الْإِنْسَانَ",
    banglaUccaron: "খালাকাল ইনসান",
    banglaMeaning: "তিনি মানুষ সৃষ্টি করেছেন।"
  },
  {
    ayahNumber: 4,
    arabic: "عَلَّمَهُ الْبَيَانَ",
    banglaUccaron: "আল্লামাহুল বাইয়ান",
    banglaMeaning: "তিনি তাকে বাকপ্রতিভা শিক্ষা দিয়েছেন।"
  },
  {
    ayahNumber: 5,
    arabic: "الشَّمْسُ وَالْقَمَرُ بِحُسْبَانٍ",
    banglaUccaron: "আশ শামসু ওয়াল কামারু বিহুসবান",
    banglaMeaning: "সূর্য ও চন্দ্র নির্দিষ্ট হিসাবে চলমান।"
  },
  {
    ayahNumber: 6,
    arabic: "وَالنَّجْمُ وَالشَّجَرُ يَسْجُدَانِ",
    banglaUccaron: "ওয়ান নাজমু ওয়াশ শাজারু য়াসজুদান",
    banglaMeaning: "তারা ও গাছপালা সিজদা করে।"
  },
  {
    ayahNumber: 7,
    arabic: "وَالسَّمَاءَ رَفَعَهَا وَوَضَعَ الْمِيزَانَ",
    banglaUccaron: "ওয়াস সামা আ রাফা'আহা ওয়া ওয়াযআদাল মীযান",
    banglaMeaning: "আকাশকে উঁচু করেছেন এবং মাপতৌল স্থাপন করেছেন।"
  },
  {
    ayahNumber: 8,
    arabic: "أَلَّا تَطْغَوْا فِي الْمِيزَانِ",
    banglaUccaron: "আল্লা তাতগাওঁফী মীযান",
    banglaMeaning: "যাতে তোমরা মাপতৌলে সীমালঙ্ঘন না কর।"
  },
  {
    ayahNumber: 9,
    arabic: "وَأَقِيمُوا الْوَزْنَ بِالْقِسْطِ وَلَا تُخْسِرُوا الْمِيزَانَ",
    banglaUccaron: "ওয়া আকীমু ওয়াজনা বিল কিসতি ওয়া লা তুখসিরু মীযান",
    banglaMeaning: "ওজন পূর্ণ ন্যায়বিচারের সাথে প্রতিষ্ঠিত কর এবং ওজন কমিয়ে দিও না।"
  },
  {
    ayahNumber: 10,
    arabic: "وَالْأَرْضَ وَضَعَهَا لِلْأَنَامِ",
    banglaUccaron: "ওয়াল আরদা ওয়াযআাহা লিল আনাম",
    banglaMeaning: "পৃথিবী সৃষ্টিজগতের জন্য বিস্তৃত করেছেন।"
  },
  {
    ayahNumber: 11,
    arabic: "فِيهَا فَاكِهَةٌ وَالنَّخْلُ ذَاتُ الْأَكْمَامِ",
    banglaUccaron: "ফীহা ফাকিহাতুন ওয়ান নাখলু যাতুল আকমাম",
    banglaMeaning: "তাতে ফলমূল ও খেজুর গাছ ঝুড়িপূর্ণ।"
  },
  {
    ayahNumber: 12,
    arabic: "وَالْحَبُّ ذُو الْعَصْفِ وَالرَّيْحَانُ",
    banglaUccaron: "ওয়াল হাব্বু যুল আসফি ওয়ার রাইহান",
    banglaMeaning: "শস্য ও সুগন্ধি ফুল।"
  },
  {
    ayahNumber: 13,
    arabic: "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ",
    banglaUccaron: "ফা বিআইয়ই আলাই রাব্বিকুমা তুকাজ্জিবান",
    banglaMeaning: "তোমাদের রবের কোন নেয়ামতই কি তোমরা অস্বীকার করবে?"
  },
  {
    ayahNumber: 14,
    arabic: "خَلَقَ الْإِنْسَانَ مِنْ صَلْصَالٍ كَالْفَخَّارِ",
    banglaUccaron: "খালাকাল ইনসানা মিন সালসালিক কাল ফাখখার",
    banglaMeaning: "মানুষ সৃষ্টি করেছেন মাটির পাত্রের মতো শুষ্ক মৃত্তিকা থেকে।"
  },
  {
    ayahNumber: 15,
    arabic: "وَخَلَقَ الْجَانَّ مِنْ مَارِجٍ مِنْ نَارٍ",
    banglaUccaron: "ওয়া খালাকাল জান্না মিন মারিজিম নার",
    banglaMeaning: "জিন সৃষ্টি করেছেন আগুনের ধোঁয়া থেকে।"
  },
  {
    ayahNumber: 16,
    arabic: "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ",
    banglaUccaron: "ফা বিআইয়ই আলাই রাব্বিকুমা তুকাজ্জিবান",
    banglaMeaning: "তোমাদের রবের কোন নেয়ামতই কি তোমরা অস্বীকার করবে?"
  },
  {
    ayahNumber: 17,
    arabic: "رَبُّ الْمَشْرِقَيْنِ وَرَبُّ الْمَغْرِبَيْنِ",
    banglaUccaron: "রাব্বুল মাশরিকাইনি ওয়া রাব্বুল মাগরিবাইন",
    banglaMeaning: "দুই উদয়াস্তের রব।"
  },
  {
    ayahNumber: 18,
    arabic: "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ",
    banglaUccaron: "ফা বিআইয়ই আলাই রাব্বিকুমা তুকাজ্জিবান",
    banglaMeaning: "তোমাদের রবের কোন নেয়ামতই কি তোমরা অস্বীকার করবে?"
  },
  {
    ayahNumber: 19,
    arabic: "مَرَجَ الْبَحْرَيْنِ يَلْتَقِيَانِ",
    banglaUccaron: "মারাজাল বাহরাইনি য়ালতাকিয়ান",
    banglaMeaning: "দুই সমুদ্র মিলিত হয়েছে।"
  },
  {
    ayahNumber: 20,
    arabic: "بَيْنَهُمَا بَرْزَخٌ لَا يَبْغِيَانِ",
    banglaUccaron: "বাইনাহুমা বারযাখুল লা য়াবগিয়ান",
    banglaMeaning: "তাদের মাঝে অদৃশ্য প্রাচীর, তারা একে অপরের সীমায় প্রবেশ করে না।"
  },
  {
    ayahNumber: 21,
    arabic: "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ",
    banglaUccaron: "ফা বিআইয়ই আলাই রাব্বিকুমা তুকাজ্জিবান",
    banglaMeaning: "তোমাদের রবের কোন নেয়ামতই কি তোমরা অস্বীকার করবে?"
  },
  {
    ayahNumber: 22,
    arabic: "يَخْرُجُ مِنْهُمَا اللُّؤْلُؤُ وَالْمَرْجَانُ",
    banglaUccaron: "ইয়াখরুজু মিনহুমাল লু'লু'উ ওয়াল মারজান",
    banglaMeaning: "তাদের থেকে মুক্তা ও মুক্তা জরি প্রাপ্ত হয়।"
  },
  {
    ayahNumber: 23,
    arabic: "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ",
    banglaUccaron: "ফা বিআইয়ই আলাই রাব্বিকুমা তুকাজ্জিবান",
    banglaMeaning: "তোমাদের রবের কোন নেয়ামতই কি তোমরা অস্বীকার করবে?"
  },
  {
    ayahNumber: 24,
    arabic: "وَلَهُ الْجَوَاسِمُ الْمَسْخَرَةُ",
    banglaUccaron: "ওয়া লাহুল জাওয়াসিমুল মাসখারাতু",
    banglaMeaning: "তাঁরই দাবানল জাহাজসমূহ।"
  },
  {
    ayahNumber: 25,
    arabic: "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ",
    banglaUccaron: "ফা বিআইয়ই আলাই রাব্বিকুমা তুকাজ্জিবান",
    banglaMeaning: "তোমাদের রবের কোন নেয়ামতই কি তোমরা অস্বীকার করবে?"
  },
  {
    ayahNumber: 26,
    arabic: "وَجْهُ رَبِّكَ ذُو الْجَلَالِ وَالْإِكْرَامِ",
    banglaUccaron: "ওয়াজহু রাব্বিকা যুল জালালি ওয়াল ইকরাম",
    banglaMeaning: "তোমার রবের মহিমান্বিত সত্তা।"
  },
  {
    ayahNumber: 27,
    arabic: "وَيَبْقَىٰ وَجْهُ رَبِّكَ ذُو الْجَلَالِ وَالْإِكْرَامِ",
    banglaUccaron: "ওয়া ইয়াবক্বা ওয়াজহু রাব্বিকা যুল জালালি ওয়াল ইকরাম",
    banglaMeaning: "তোমার রবের মহিমান্বিত সত্তাই চিরস্থায়ী।"
  }
]
  },

  {
  id: 4,
  suraKey: "baqara",
  surahNumber: 2,
  nameBangla: "আল বাকারা",
  nameArabic: "البقرة",
  totalAyah: 5,
  revelation: "Madani",
  ayahs: [
    {
      ayahNumber: 1,
      arabic: "الٓمٓ",
      banglaUccaron: "আলিফ লাম মীম",
      banglaMeaning: "আলিফ-লাম-মীম।"
    },
    {
      ayahNumber: 2,
      arabic: "ذَٰلِكَ الْكِتَابُ لَا رَيْبَ فِيهِ هُدًى لِلْمُتَّقِينَ",
      banglaUccaron: "যালিকাল কিতাবু লা রাইবা ফীহি হুদান লিল মুত্তাক্বীন",
      banglaMeaning: "এই বইতে কোনো সন্দেহ নেই, এটি পরহেযারীদের জন্য পথপ্রদর্শক।"
    },
    {
      ayahNumber: 3,
      arabic: "الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ",
      banglaUccaron: "আল্লাজীনা ইউ'মিনূনা বিল গাইবি ওয়া ইউকীমূনা ছালাতা ওয়া মিম্মা রাযাকনাহুম ইউনফিকূন",
      banglaMeaning: "যারা অদৃশ্যে ঈমান আনে, নামায কায়েম করে এবং আমার দেওয়া রিযিক থেকে খরচ করে।"
    },
    {
      ayahNumber: 4,
      arabic: "وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ",
      banglaUccaron: "ওয়াল্লাজীনা ইউ'মিনূনা বিমা উনযিলা ইলাইকা ওয়া মা উনযিলা মিন কাবলিকা ওয়া বিল আখিরাতি হুম ইউকীনূন",
      banglaMeaning: "যারা তোমার প্রতি অবতীর্ণ এবং তোমার পূর্বেও অবতীর্ণ সত্যের প্রতি ঈমান আনে এবং পরকালে দৃঢ়ভাবে বিশ্বাসী।"
    },
    {
      ayahNumber: 5,
      arabic: "أُولَٰئِكَ عَلَىٰ هُدًى مِنْ رَبِّهِمْ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ",
      banglaUccaron: "উলা-ইকা আলা হুদাম মিন রাব্বিহিম ওয়া উলা-ইকা হুমুল মুফলিহূন",
      banglaMeaning: "তারা তাদের রবের পক্ষ থেকে পথপ্রদর্শনের উপর প্রতিষ্ঠিত এবং তারাই সফলকাম।"
    }
  ]
},


  {
  id: 5,
  suraKey: "duha",
  surahNumber: 93,
  nameBangla: "আদ-দুহা",
  nameArabic: "الضحى",
  totalAyah: 11,
  revelation: "Makki",
  ayahs: [
    {
      ayahNumber: 1,
      arabic: "وَالضُّحَىٰ",
      banglaUccaron: "ওয়াদ দুহা",
      banglaMeaning: "শপথ পূর্বাহ্নের।"
    },
    {
      ayahNumber: 2,
      arabic: "وَاللَّيْلِ إِذَا سَجَىٰ",
      banglaUccaron: "ওয়াল লাইলি ইযা সাজা",
      banglaMeaning: "এবং শপথ রাত্রির যখন তা নিঝুম হয়।"
    },
    {
      ayahNumber: 3,
      arabic: "مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَىٰ",
      banglaUccaron: "মা ওয়াদ্দা'আকা রাব্বুকা ওয়া মা কালা",
      banglaMeaning: "তোমার রব তোমাকে পরিত্যাগ করেননি এবং তিনি অসন্তুষ্টও নন।"
    },
    {
      ayahNumber: 4,
      arabic: "وَلَلْآخِرَةُ خَيْرٌ لَكَ مِنَ الْأُولَىٰ",
      banglaUccaron: "ওয়া লাল আখিরাতু খাইরুল লাকা মিনাল উলা",
      banglaMeaning: "এবং অবশ্যই পরকাল তোমার জন্য প্রথম জীবনের চেয়ে উত্তম।"
    },
    {
      ayahNumber: 5,
      arabic: "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰ",
      banglaUccaron: "ওয়া লাসাওফা ইউ'তীকা রাব্বুকা ফাতারযা",
      banglaMeaning: "এবং শীঘ্রই তোমার রব তোমাকে প্রদান করবেন যাতে তুমি সন্তুষ্ট হও।"
    },
    {
      ayahNumber: 6,
      arabic: "أَلَمْ يَجِدْكَ يَتِيمًا فَآوَىٰ",
      banglaUccaron: "আলাম য়াজিদকা ইয়াতীমান ফাআওয়া",
      banglaMeaning: "তোমাকে তিনি কি অনাথ অবস্থায় পাননি এবং আশ্রয় দেননি?"
    },
    {
      ayahNumber: 7,
      arabic: "وَوَجَدَكَ ضَالًّا فَهَدَىٰ",
      banglaUccaron: "ওয়া ওয়াজাদাকা যাল্লান ফাহাদা",
      banglaMeaning: "এবং তোমাকে পথভ্রষ্ট অবস্থায় পেয়ে পথ দেখাননি?"
    },
    {
      ayahNumber: 8,
      arabic: "وَوَجَدَكَ عَائِلًا فَأَغْنَىٰ",
      banglaUccaron: "ওয়া ওয়াজাদাকা আইলান ফাগনা",
      banglaMeaning: "এবং তোমাকে অভাবগ্রস্ত অবস্থায় পেয়ে ধনী করে দেননি?"
    },
    {
      ayahNumber: 9,
      arabic: "فَأَمَّا الْيَتِيمَ فَلَا تَقْهَرْ",
      banglaUccaron: "ফাম্মাল ইয়াতীমা ফালা তাকহার",
      banglaMeaning: "সুতরাং অনাথের প্রতি কঠোর হয়ো না।"
    },
    {
      ayahNumber: 10,
      arabic: "وَأَمَّا السَّائِلَ فَلَا تَنْهَرْ",
      banglaUccaron: "ওয়াম্মাস সাইলা ফালা তানহার",
      banglaMeaning: "এবং ভিক্ষুকের প্রতি তিরস্কার করো না।"
    },
    {
      ayahNumber: 11,
      arabic: "وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ",
      banglaUccaron: "ওয়াম্মা বিনিমাতি রাব্বিকা ফাহাদ্দিস",
      banglaMeaning: "এবং তোমার রবের নেয়ামত সম্পর্কে ঘোষণা কর।"
    }
  ]
},

{
  id: 6,
  suraKey: "inshirah",
  surahNumber: 94,
  nameBangla: "আল ইনশিরাহ",
  nameArabic: "الشرح",
  totalAyah: 8,
  revelation: "Makki",
  ayahs: [
    {
      ayahNumber: 1,
      arabic: "أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ",
      banglaUccaron: "আলাম নাশরাহ লাকা সদরাক",
      banglaMeaning: "আমি কি তোমার বক্ষ প্রশস্ত করে দিইনি?"
    },
    {
      ayahNumber: 2,
      arabic: "وَوَضَعْنَا عَنْكَ وِزْرَكَ",
      banglaUccaron: "ওয়া ওয়াযআনা আনকা উইজরাক",
      banglaMeaning: "এবং তোমার থেকে তোমার ভার অপসারণ করেছি?"
    },
    {
      ayahNumber: 3,
      arabic: "الَّذِي أَنْقَضَ ظَهْرَكَ",
      banglaUccaron: "আল্লাজী আনকাদা যাহরাক",
      banglaMeaning: "যা তোমার পৃষ্ঠভাগ ভারাক্রান্ত করেছিল।"
    },
    {
      ayahNumber: 4,
      arabic: "وَرَفَعْنَا لَكَ ذِكْرَكَ",
      banglaUccaron: "ওয়া রাফা'না লাকা যিকরাক",
      banglaMeaning: "এবং তোমার প্রতি তোমার স্মৃতি উন্নত করেছি।"
    },
    {
      ayahNumber: 5,
      arabic: "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا",
      banglaUccaron: "ফাইন্না মা'আল উসরি ইউসরা",
      banglaMeaning: "সুতরাং নিশ্চয় কষ্টের সাথে স্বস্তি রয়েছে।"
    },
    {
      ayahNumber: 6,
      arabic: "إِنَّ مَعَ الْعُسْرِ يُسْرًا",
      banglaUccaron: "ইন্না মা'আল উসরি ইউসরা",
      banglaMeaning: "নিশ্চয় কষ্টের সাথে স্বস্তি রয়েছে।"
    },
    {
      ayahNumber: 7,
      arabic: "فَإِذَا فَرَغْتَ فَانْصَبْ",
      banglaUccaron: "ফাইযা ফারাগতা ফানসাব",
      banglaMeaning: "সুতরাং যখন তুমি মুক্ত হয়ে যাও তখন পরিশ্রম কর।"
    },
    {
      ayahNumber: 8,
      arabic: "وَإِلَىٰ رَبِّكَ فَارْغَبْ",
      banglaUccaron: "ওয়া ইলা রাব্বিকা ফারগাব",
      banglaMeaning: "এবং তোমার রবের প্রতি আকাঙ্ক্ষা কর।"
    }
  ]
},

  {
  id: 7,
  suraKey: "kafirun",
  surahNumber: 109,
  nameBangla: "আল কাফিরুন",
  nameArabic: "الكافرون",
  totalAyah: 6,
  revelation: "Makki",
  ayahs: [
    {
      ayahNumber: 1,
      arabic: "قُلْ يَـٰٓأَيُّهَا ٱلْكَـٰفِرُونَ",
      banglaUccaron: "ক্বুল ইয়া আইয়্যুহাল কাফিরূন",
      banglaMeaning: "বলুন, হে কাফিররা!"
    },
    {
      ayahNumber: 2,
      arabic: "لَآ أَعْبُدُ مَا تَعْبُدُونَ",
      banglaUccaron: "লা আআবুদু মা তা'বুদূন",
      banglaMeaning: "আমি যাকে তোমরা পূজা কর, তাকে পূজা করি না।"
    },
    {
      ayahNumber: 3,
      arabic: "وَلَآ أَنتُمْ عَـٰبِدُونَ مَآ أَعْبُدُ",
      banglaUccaron: "ওয়া লা আনতুম আবিদূনা মা আআবুদু",
      banglaMeaning: "এবং তোমরাও আমার পূজিতকে পূজা কর না।"
    },
    {
      ayahNumber: 4,
      arabic: "وَلَآ أَنَا۠ عَابِدٌۭ مَّا عَبَدْتُمْ",
      banglaUccaron: "ওয়া লা আনা আবিদুম মা আবাদতুম",
      banglaMeaning: "আর আমিও কখনো পূজা করব না যা তোমরা পূজা করেছ।"
    },
    {
      ayahNumber: 5,
      arabic: "وَلَآ أَنتُمْ عَـٰبِدُونَ مَآ أَعْبُدُ",
      banglaUccaron: "ওয়া লা আনতুম আবিদূনা মা আআবুদু",
      banglaMeaning: "এবং তোমরাও কখনো পূজা করবে না আমার পূজিতকে।"
    },
    {
      ayahNumber: 6,
      arabic: "لَكُمْ دِينُكُمْ وَلِىَ دِينِ",
      banglaUccaron: "লাকুম দীনুকুম ওয়া লিয়া দীন",
      banglaMeaning: "তোমাদের জন্য তোমাদের দীন, আমার জন্য আমার দীন।"
    }
  ]
}
,

  // 🤍 Al-Ikhlas
  {
    id: 8,
    suraKey: "ikhlas",
    surahNumber: 112,
    nameBangla: "আল ইখলাস",
    nameArabic: "الإخلاص",
    totalAyah: 4,
    revelation: "Makki",
    ayahs: [
      {
        ayahNumber: 1,
        arabic: "قُلْ هُوَ اللَّهُ أَحَدٌ",
        banglaUccaron: "ক্বুল হুয়াল্লাহু আহাদ",
        banglaMeaning: "বলুন, তিনি আল্লাহ, এক।",
      },
    ],
  },

  {
  id: 9,
  suraKey: "falaq",
  surahNumber: 113,
  nameBangla: "আল ফালাক",
  nameArabic: "الفلق",
  totalAyah: 5,
  revelation: "Makki",
  ayahs: [
    {
      ayahNumber: 1,
      arabic: "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ",
      banglaUccaron: "ক্বুল আউযু বিরাব্বিল ফালাক",
      banglaMeaning: "বলুন, আমি আশ্রয় চাই প্রভাতের রবের।"
    },
    {
      ayahNumber: 2,
      arabic: "مِنْ شَرِّ مَا خَلَقَ",
      banglaUccaron: "মিন শাররি মা খালাক",
      banglaMeaning: "তিনি যা সৃষ্টি করেছেন, তার অনিষ্ট থেকে।"
    },
    {
      ayahNumber: 3,
      arabic: "وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ",
      banglaUccaron: "ওয়া মিন শাররি গাসিকিম ইযা ওয়াকাব",
      banglaMeaning: "এবং রাত্রির অনিষ্ট থেকে যখন তা অন্ধকারে আচ্ছন্ন হয়।"
    },
    {
      ayahNumber: 4,
      arabic: "وَمِنْ شَرِّ ٱلنَّفَّاثَٰتِ فِى ٱلْعُقَدِ",
      banglaUccaron: "ওয়া মিন শাররিন নাফফাসাতি ফিল উকাদ",
      banglaMeaning: "এবং গ্রন্থিতে ফুঁকমারীদের অনিষ্ট থেকে।"
    },
    {
      ayahNumber: 5,
      arabic: "وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ",
      banglaUccaron: "ওয়া মিন শাররি হাসিদিম ইযা হাসাদ",
      banglaMeaning: "এবং হিংসুকের অনিষ্ট থেকে যখন সে হিংসা করে।"
    }
  ]
},

  // 🌑 An-Nas
  {
  id: 10,
  suraKey: "nas",
  surahNumber: 114,
  nameBangla: "আন নাস",
  nameArabic: "الناس",
  totalAyah: 6,
  revelation: "Makki",
  ayahs: [
    {
      ayahNumber: 1,
      arabic: "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ",
      banglaUccaron: "ক্বুল আউযু বিরাব্বিন্নাস",
      banglaMeaning: "বলুন, আমি আশ্রয় চাই মানুষের রবের।"
    },
    {
      ayahNumber: 2,
      arabic: "مَلِكِ ٱلنَّاسِ",
      banglaUccaron: "মালিকিন্নাস",
      banglaMeaning: "মানুষের রাজা।"
    },
    {
      ayahNumber: 3,
      arabic: "إِلَٰهِ ٱلنَّاسِ",
      banglaUccaron: "ইলাহিন্নাস",
      banglaMeaning: "মানুষের উপাস্য।"
    },
    {
      ayahNumber: 4,
      arabic: "مِنْ شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ",
      banglaUccaron: "মিন শাররিল ওয়াসওয়াসিল খান্নাস",
      banglaMeaning: "তো ওয়াসওয়াসকারীর অনিষ্ট থেকে, যে লুকিয়ে থাকে।"
    },
    {
      ayahNumber: 5,
      arabic: "ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ",
      banglaUccaron: "আল্লাজী ইউওয়াস্বিসু ফী সুদুরিন্নাস",
      banglaMeaning: "যে মানুষের অন্তরে ওয়াসওয়াসা করে।"
    },
    {
      ayahNumber: 6,
      arabic: "مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ",
      banglaUccaron: "মিনাল জিন্নাতি ওয়ান্নাস",
      banglaMeaning: "জিন ও মানুষের মধ্য থেকে।"
    }
  ]
}
,

{
  id: 90,
  suraKey: "fatiha",
  surahNumber: 1,
  nameBangla: "আল ফাতিহা",
  nameArabic: "الفاتحة",
  totalAyah: 7,
  revelation: "Makki",
  ayahs: [
    {
      ayahNumber: 1,
      arabic: "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      banglaUccaron: "বিসমিল্লাহির রাহমানির রাহীম",
      banglaMeaning: "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।"
    },
    {
      ayahNumber: 2,
      arabic: "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
      banglaUccaron: "আলহামদু লিল্লাহি রাব্বিল আলামীন",
      banglaMeaning: "সকল প্রশংসা আল্লাহর জন্য, সকল জগতের রব।"
    },
    {
      ayahNumber: 3,
      arabic: "الرَّحْمَٰنِ الرَّحِيمِ",
      banglaUccaron: "আর রাহমানির রাহীম",
      banglaMeaning: "পরম করুণাময়, অতি দয়ালু।"
    },
    {
      ayahNumber: 4,
      arabic: "مَالِكِ يَوْمِ الدِّينِ",
      banglaUccaron: "মালিকি ইয়াওমিদ্দীন",
      banglaMeaning: "প্রতিদিনের মালিক।"
    },
    {
      ayahNumber: 5,
      arabic: "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ",
      banglaUccaron: "ইয়্যাকা না'বুদু ওয়া ইয়্যাকা নাসতাই'নু",
      banglaMeaning: "আমরা একমাত্র তোমারই ইবাদত করি এবং একমাত্র তোমার কাছেই সাহায্য প্রার্থনা করি।"
    },
    {
      ayahNumber: 6,
      arabic: "ٱهْدِنَا ٱلصِّرَٰطَ ٱلْمُسْتَقِيمَ",
      banglaUccaron: "ইহদিনাস সিরাতাল মুসতাকীম",
      banglaMeaning: "আমাদেরকে সরল পথ দেখাও।"
    },
    {
      ayahNumber: 7,
      arabic: "صِرَٰطَ ٱلَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ ٱلْمَغْضُوبِ عَلَيْهِمْ وَلَا ٱلضَّآلِّينَ",
      banglaUccaron: "সিরাতাল্লাজীনা আনআমতা আলাইহিম গাইরিল মাগদুবি আলাইহিম ওয়া লাদ দাল্লীন",
      banglaMeaning: "তাদের পথ যাদের প্রতি তুমি নেয়ামত দান করেছ, যাদের প্রতি গজব নাযিল হয়েছে তাদের পথ নয় এবং যারা পথভ্রষ্ট হয়েছে তাদেরও নয়।"
    }
  ]
},


  // 🕋 Durood-e-Taj
  {
  id: 11,
  suraKey: "durood_taj",
  surahNumber: null,
  nameBangla: "দরূদে তাজ",
  nameArabic: "دُرُودِ تَاج",
  totalAyah: 1,
  revelation: "Other",
  ayahs: [
    {
      ayahNumber: 1,
      arabic: "اللَّهُمَّ صَلِّ عَلَىٰ سَيِّدِنَا مُحَمَّدٍ وَعَلَىٰ آلِهِ وَصَحْبِهِ وَبَارِكْ وَسَلِّمْ تَوْجِيهَ الْعَرْشِ وَاحِدَ وَالْحَمْدُ لَكَ جَمِيعًا بِالْجَمِيعِ وَالْحَمْدُ لَكَ مِلْءَ السَّمَاوَاتِ وَالْأَرْضِ وَمِلْءَ مَا بَيْنَهُمَا وَمِلْءَ مَا بَعْدَهُمَا مِنْ شَيْءٍ بِحَقِّ تَاجِكَ الْأَعْلَى وَجَمَالِ كَمَالِكَ الْأَكْمَلِ وَنُورِ وَجْهِكَ الْأَزْهَرِ وَمِثَالِ جَمَالِكَ الْأَبَدِيِّ الْبَاقِي",
      banglaUccaron: "আল্লাহুম্মা সাল্লি আলা সাইয়্যিদিনা মুহাম্মাদিন ওয়া আলা আলিহি ওয়া সাহবিহি ওয়া বারিক ওয়া সাল্লিম তাওজীহাল আরশি ওয়াহিদা ওয়াল হামদু লাকা জামীআন বিল জামীই ওয়াল হামদু লাকা মিলআস সামাওয়াতি ওয়াল আরদি ওয়া মিলআ মা বাইনাহুমা ওয়া মিলআ মা বা'দাহুমা মিন শাইয়িম বিহাক্কি তাজিকাল আআলা ওয়া জামালি কামালিকাল আকমালি ওয়া নূরি ওয়াজহিকাল আযহারি ওয়া মিসালি জামালিকাল আবাদিল বাকী",
      banglaMeaning: "হে আল্লাহ! আমাদের নেতা মুহাম্মদ (সা.), তাঁর পরিবার ও সাহাবীগণের উপর রহমত বর্ষণ করুন, বরকত প্রদান করুন এবং শান্তি বর্ষণ করুন। আরশের দিকে মুখ করিয়ে একক আল্লাহর জন্য। সমস্ত প্রশংসা আপনার জন্য, সম্পূর্ণভাবে এবং সর্বত্র। আকাশ, পৃথিবী, তাদের মধ্যবর্তী স্থান এবং তার বাইরের সবকিছু আপনার জন্য প্রশংসায় পূর্ণ। আপনার সর্বোচ্চ তাজের হকের জন্য, আপনার পরিপূর্ণ সৌন্দর্যের জন্য, আপনার উজ্জ্বলতম মুখের নূরের জন্য এবং আপনার চিরস্থায়ী সৌন্দর্যের আদর্শের জন্য।"
    }
  ]
}

];
