export interface Ayah {
  ayahNumber: number;
  arabic: string;
  banglaUccaron: string;
  banglaMeaning: string;
}

export interface Sura {
  id: number;
  suraKey: string;
  surahNumber: number | null;
  nameBangla: string;
  nameArabic: string;
  totalAyah: number;
  revelation: "Makki" | "Madani" | "Other";
  ayahs: Ayah[];
}

export const suraList: Sura[] = [
  // 🌙 Al-Muzzammil (1–19)
  {
    id: 1,
    suraKey: "muzzammil",
    surahNumber: 73,
    nameBangla: "আল মুয্যাম্মিল",
    nameArabic: "المزمل",
    totalAyah: 19,
    revelation: "Makki",
    ayahs: [
      {
        ayahNumber: 1,
        arabic: "يَٰٓأَيُّهَا ٱلْمُزَّمِّلُ",
        banglaUccaron: "ইয়াআইয়ুহাল মুঝঝাম্মিল",
        banglaMeaning: "ওহে চাদরে আবৃত (ব্যক্তি)!",
      },
      {
        ayahNumber: 2,
        arabic: "قُمِ ٱلَّيْلَ إِلَّا قَلِيلًا",
        banglaUccaron: "কুমিল্লাইলা ইল্লা- কালীলা",
        banglaMeaning: "রাতে সালাতের জন্য দাঁড়াও তবে (রাতের) কিছু অংশ বাদে",
      },
      {
        ayahNumber: 3,
        arabic: "نِّصْفَهُۥ مِنَ ٱلَّيْلِ أَوِ ٱنْقُصْ مِنْهُ قَلِيلًا",
        banglaUccaron: "নিসফাহূআবিনকুস মিনহু কালীলা",
        banglaMeaning: "রাতের অর্ধেক (সময় দাঁড়াও) কিংবা তার থেকে কিছুটা কম কর",
      },
      {
        ayahNumber: 4,
        arabic: "أَوْ زِدْ عَلَيْهِ وَرَتِّلِ ٱلْقُرْءَانَ تَرْتِيلًا",
        banglaUccaron: "আও ঝিদ ‘আলাইহি ওয়া রাত্তিলিল কুরআনা তারতীলা",
        banglaMeaning:
          "অথবা তার চেয়ে বাড়াও, আর ধীরে ধীরে সুস্পষ্টভাবে কুরআন পাঠ কর।",
      },
      {
        ayahNumber: 5,
        arabic: "إِنَّا سَنُلْقِى عَلَيْكَ قَوْلًا ثَقِيلًا",
        banglaUccaron: "ইন্না ছানুলকী ‘আলাইকা কাওলান ছাকীলা",
        banglaMeaning: "আমি আপনার প্রতি অবতীর্ণ করেছি গুরুত্বপূর্ণ বাণী",
      },
      {
        ayahNumber: 6,
        arabic:
          "إِنَّ نَاشِئَةَ ٱلَّيْلِ هِىَ أَشَدُّ وَطْـًا وَأَقْوَمُ قِيلًا",
        banglaUccaron:
          "ইন্না না-শিআতাল্লাইলি হিয়া আশাদ্দুওয়াত‘আওঁ ওয়া আকওয়ামুকীলা",
        banglaMeaning:
          "নিশ্চয় এবাদতের জন্যে রাতে বিছানা ছেড়ে উঠা আত্মসংযমের জন্য বেশি কার্যকর এবং (কুরআন) স্পষ্ট উচ্চারণের অনুকূল।",
      },
      {
        ayahNumber: 7,
        arabic: "إِنَّ لَكَ فِى ٱلنَّهَارِ سَبْحًا طَوِيلًا",
        banglaUccaron: "ইন্না লাকা ফিন্নাহারি ছাবহান তাবিলা",
        banglaMeaning: "নিশ্চয় দিনের বেলায় তোমার জন্য আছে দীর্ঘ কর্মব্যস্ততা।",
      },
      {
        ayahNumber: 8,
        arabic: "وَٱذْكُرِ ٱسْمَ رَبِّكَ وَتَبَتَّلْ إِلَيْهِ تَبْتِيلًا",
        banglaUccaron: "ওয়াযকুরিছমা রাব্বিকা ওয়া তাবাত্তাল ইলাইহি তাবতীলা",
        banglaMeaning:
          "কাজেই তুমি তোমার প্রতিপালকের নাম স্মরণ কর এবং একাগ্রচিত্তে তাঁর প্রতি মগ্ন হও।",
      },
      {
        ayahNumber: 9,
        arabic:
          "رَبُّ ٱلْمَشْرِقِ وَٱلْمَغْرِبِ لَآ إِلَٰهَ إِلَّا هُوَ فَٱتَّخِذْهُ وَكِيلًا",
        banglaUccaron:
          "রাব্বুল মাশরিকিওয়াল মাগরিবি লাইলাহা ইল্লাহুওয়া ফাত্তাখিযহু ওয়াকীলা",
        banglaMeaning:
          "তিনি পূর্ব ও পশ্চিমের অধিকর্তা। তিনি ব্যতীত কোন উপাস্য নেই। অতএব, তাঁকেই গ্রহণ করুন কর্মবিধায়করূপে",
      },
      {
        ayahNumber: 10,
        arabic:
          "وَٱصْبِرْ عَلَىٰ مَا يَقُولُونَ وَٱهْجُرْهُمْ هَجْرًا جَمِيلًا",
        banglaUccaron: "ওয়াসবির ‘আলামাইয়াকূলূনা ওয়াহজুরহুম হাজরান জামীলা",
        banglaMeaning:
          "তারা যা বলে সে ব্যাপারে ধৈর্য ধারণ কর আর ভদ্রতার সঙ্গে তাদেরকে পরিহার ক’রে চল।",
      },
      {
        ayahNumber: 11,
        arabic:
          "وَذَرْنِى وَٱلْمُكَذِّبِينَ أُو۟لِى ٱلنَّعْمَةِ وَمَهِّلْهُمْ قَلِيلًا",
        banglaUccaron:
          "ওয়া যারনী ওয়াল মুকাযযিবীনা উলিন না‘মাতি ওয়া মাহহিলহুম কালীলা",
        banglaMeaning:
          "বিলাস সামগ্রীর অধিকারী মিথ্যারোপকারীদেরকে আমার হাতে ছেড়ে দিন এবং তাদেরকে কিছুটা সময় অবকাশ দিন",
      },
      {
        ayahNumber: 12,
        arabic: "إِنَّ لَدَيْنَآ أَنكَالًا وَجَحِيمًا",
        banglaUccaron: "ইন্না লাদাইনাআনকালাওঁ ওয়া জাহীমা",
        banglaMeaning: "নিশ্চয় আমার কাছে আছে শিকল ও অগ্নিকুন্ড",
      },
      {
        ayahNumber: 13,
        arabic: "وَطَعَامًا ذَا غُصَّةٍ وَعَذَابًا أَلِيمًا",
        banglaUccaron: "ওয়া তা‘আমান যাগুসসাতিওঁ ওয়া‘আযাবান আলীমা",
        banglaMeaning: "আর গলায় আটকে যায় এমন খাবার এবং যন্ত্রণাদায়ক শাস্তি",
      },
      {
        ayahNumber: 14,
        arabic:
          "يَوْمَ تَرْجُفُ ٱلْأَرْضُ وَٱلْجِبَالُ وَكَانَتِ ٱلْجِبَالُ كَثِيبًا مَّهِيلًا",
        banglaUccaron:
          "ইয়াওমা তারজুফুল আরদুওয়ালজিবা-লুওয়াকা-নাতিল জিবা-লুকাছীবাম মাহীলা",
        banglaMeaning:
          "যেদিন পৃথিবী পর্বতমালা প্রকম্পিত হবে এবং পর্বতসমূহ হয়ে যাবে চলমান বালুকারাশি।",
      },
      {
        ayahNumber: 15,
        arabic:
          "إِنَّآ أَرْسَلْنَآ إِلَيْكُمْ رَسُولًا شَٰهِدًا عَلَيْكُمْ كَمَآ أَرْسَلْنَآ إِلَىٰ فِرْعَوْنَ رَسُولًا",
        banglaUccaron:
          "ইন্নাআরছালনাইলাইকুম রাছূলান শা-হিদান ‘আলাইকুম কামাআরছালনাইলাফির‘আওনা রাছূলা",
        banglaMeaning:
          "আমি তোমাদের কাছে একজন রসূলকে তোমাদের জন্যে সাক্ষী করে প্রেরণ করেছি, যেমন প্রেরণ করেছিলাম ফেরাউনের কাছে একজন রসূল।",
      },
      {
        ayahNumber: 16,
        arabic: "فَعَصَىٰ فِرْعَوْنُ ٱلرَّسُولَ فَأَخَذْنَٰهُ أَخْذًا وَبِيلًا",
        banglaUccaron: "ফা‘আসা-ফির‘আওনুর রাছূলা ফাআখাযনা-হু আখযাওঁ ওয়া বীলা",
        banglaMeaning:
          "অতঃপর ফেরাউন সেই রসূলকে অমান্য করল, ফলে আমি তাকে কঠিন শাস্তি দিয়েছি।",
      },
      {
        ayahNumber: 17,
        arabic:
          "فَكَيْفَ تَتَّقُونَ إِن كَفَرْتُمْ يَوْمًا يَجْعَلُ ٱلْوِلْدَٰنَ شِيبًا",
        banglaUccaron:
          "ফাকাইফা তাত্তাকূনা ইন কাফারতুম ইয়াওমাইঁ ইয়াজ‘আলুল বিলদা-না শীবা",
        banglaMeaning:
          "অতএব, তোমরা কিরূপে আত্নরক্ষা করবে যদি তোমরা সেদিনকে অস্বীকার কর, যেদিন বালককে করে দিব বৃদ্ধ।",
      },
      {
        ayahNumber: 18,
        arabic: "ٱلسَّمَآءُ مُنفَطِرٌۢ بِهِۦ كَانَ وَعْدُهُۥ مَفْعُولًا",
        banglaUccaron: "আছছামাউ মুনফাতিরুম বিহী কা-না ওয়া‘দুহূমাফ‘ঊলা",
        banglaMeaning:
          "সেদিন আকাশ বিদীর্ণ হবে। তার প্রতিশ্রুতি অবশ্যই বাস্তবায়িত হবে",
      },
      {
        ayahNumber: 19,
        arabic:
          "إِنَّ هَٰذِهِۦ تَذْكِرَةٌ فَمَن شَآءَ ٱتَّخَذَ إِلَىٰ رَبِّهِۦ سَبِيلًا",
        banglaUccaron:
          "ইন্না হা-যিহী তাযকিরাতুন ফামান শাআত্তাখাযা ইলা-রাব্বিহী ছাবীলা",
        banglaMeaning:
          "এটা উপদেশ। অতএব, যার ইচ্ছা সে তার পালনকর্তার দিকে পথ অবলম্বন করুক",
      },
    ],
  },

  // 🌿 Yasin (1–12)
  {
    id: 2,
    suraKey: "yasin",
    surahNumber: 36,
    nameBangla: "ইয়াসীন",
    nameArabic: "يس",
    totalAyah: 12,
    revelation: "Makki",
    ayahs: [
      {
        ayahNumber: 1,
        arabic: "يسٓ",
        banglaUccaron: "ইয়া-ছীন।",
        banglaMeaning: "ইয়া-সীন।",
      },
      {
        ayahNumber: 2,
        arabic: "وَٱلْقُرْءَانِ ٱلْحَكِيمِ",
        banglaUccaron: "ওয়াল কুরআ-নিল হাকীম।",
        banglaMeaning: "প্রজ্ঞাময় কোরআনের কসম।",
      },
      {
        ayahNumber: 3,
        arabic: "إِنَّكَ لَمِنَ ٱلْمُرْسَلِينَ",
        banglaUccaron: "ইন্নাকা লামিনাল মুরছালীন।",
        banglaMeaning: "নিশ্চয় আপনি প্রেরিত রসূলগণের একজন।",
      },
      {
        ayahNumber: 4,
        arabic: "عَلَىٰ صِرَٰطٍ مُّسْتَقِيمٍ",
        banglaUccaron: "‘আলা-সিরাতিম মুছতাকীম।",
        banglaMeaning: "সরল পথে প্রতিষ্ঠিত।",
      },
      {
        ayahNumber: 5,
        arabic: "تَنزِيلَ ٱلْعَزِيزِ ٱلرَّحِيمِ",
        banglaUccaron: "তানঝীলাল ‘আঝীঝির রাহীম।",
        banglaMeaning: "কোরআন পরাক্রমশালী পরম দয়ালু আল্লাহর তরফ থেকে অবতীর্ণ।",
      },
      {
        ayahNumber: 6,
        arabic: "لِتُنذِرَ قَوْمًا مَّآ أُنذِرَ ءَابَآؤُهُمْ فَهُمْ غَٰفِلُونَ",
        banglaUccaron: "লিতুনযিরা কাওমাম্মাউনযিরা আ-বাউহুম ফাহুম গা-ফিলূন।",
        banglaMeaning:
          "যাতে আপনি এমন এক জাতিকে সতর্ক করেন, যাদের পূর্ব পুরুষগণকেও সতর্ক করা হয়নি। ফলে তারা গাফেল।",
      },
      {
        ayahNumber: 7,
        arabic:
          "لَقَدْ حَقَّ ٱلْقَوْلُ عَلَىٰٓ أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ",
        banglaUccaron: "লাকাদ হাক্কাল কাওলু‘আলাআকছারিহিম ফাহুম লা-ইউ’মিনূন।",
        banglaMeaning:
          "তাদের অধিকাংশের জন্যে শাস্তির বিষয় অবধারিত হয়েছে। সুতরাং তারা বিশ্বাস স্থাপন করবে না।",
      },
      {
        ayahNumber: 8,
        arabic:
          "إِنَّا جَعَلْنَا فِىٓ أَعْنَٰقِهِمْ أَغْلَٰلًا فَهِىَ إِلَى ٱلْأَذْقَانِ فَهُم مُّقْمَحُونَ",
        banglaUccaron:
          "ইন্না- জা‘আলনা-ফী আ‘না-কিহিম আগলা-লান ফাহিয়া ইলাল আযকা-নি ফাহুম মুকমাহূন।",
        banglaMeaning:
          "আমি তাদের গর্দানে চিবুক পর্যন্ত বেড়ী পরিয়েছি। ফলে তাদের মস্তক উর্দ্ধমুখী হয়ে গেছে।",
      },
      {
        ayahNumber: 9,
        arabic:
          "وَجَعَلْنَا مِنۢ بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَٰهُمْ فَهُمْ لَا يُبْصِرُونَ",
        banglaUccaron:
          "ওয়া জা‘আল না-মিম বাইনি আইদীহিম ছাদ্দাওঁ ওয়া মিন খালফিহিম ছাদ্দান ফাআগশাইনা-হুম ফাহুম লা-ইউবসিরূন।",
        banglaMeaning:
          "আমি তাদের সামনে ও পিছনে প্রাচীর স্থাপন করেছি, অতঃপর তাদেরকে আবৃত করে দিয়েছি, ফলে তারা দেখে না।",
      },
      {
        ayahNumber: 10,
        arabic:
          "وَسَوَآءٌ عَلَيْهِمْ ءَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ",
        banglaUccaron:
          "ওয়া ছাওয়াউন ‘আলাইহিম আ আনযারতাহুম আম লাম তুনযিরহুম লা-ইউ’মিনূন।",
        banglaMeaning:
          "আপনি তাদেরকে সতর্ক করুন বা না করুন, তাদের পক্ষে দুয়েই সমান; তারা বিশ্বাস স্থাপন করবে না।",
      },
      {
        ayahNumber: 11,
        arabic:
          "إِنَّمَا تُنذِرُ مَنِ ٱتَّبَعَ ٱلذِّكْرَ وَخَشِىَ ٱلرَّحْمَٰنَ بِٱلْغَيْبِ فَبَشِّرْهُ بِمَغْفِرَةٍ وَأَجْرٍ كَرِيمٍ",
        banglaUccaron:
          "ইন্নামা-তুনযিরু মানিত্তাবা‘আযযিকরা ওয়া খাশিয়াররাহমা-না বিলগাইবি ফাবাশশিরহু বিমাগফিরাতিওঁ ওয়া আজরিন কারীম।",
        banglaMeaning:
          "আপনি কেবল তাদেরকেই সতর্ক করতে পারেন, যারা উপদেশ অনুসরণ করে এবং দয়াময় আল্লাহকে না দেখে ভয় করে। অতএব আপনি তাদেরকে সুসংবাদ দিয়ে দিন ক্ষমা ও সম্মানজনক পুরস্কারের।",
      },
      {
        ayahNumber: 12,
        arabic:
          "إِنَّا نَحْنُ نُحْىِي ٱلْمَوْتَىٰ وَنَكْتُبُ مَا قَدَّمُوا۟ وَءَاثَٰرَهُمْ ۚ وَكُلَّ شَىْءٍ أَحْصَيْنَٰهُ فِىٓ إِمَامٍ مُّبِينٍ",
        banglaUccaron:
          "ইন্না-নাহনুনুহয়িল মাওতা-ওয়া নাকতুবুমা-কাদ্দামূওয়া আ-ছা-রাহুম ওয়া কুল্লা শাইয়িন আহসাইনা-হু ফীইমা-মিম মুবীন।",
        banglaMeaning:
          "আমিই মৃতদেরকে জীবিত করি এবং তাদের কর্ম ও কীর্তিসমূহ লিপিবদ্ধ করি। আমি প্রত্যেক বস্তু স্পষ্ট কিতাবে সংরক্ষিত রেখেছি।",
      },
    ],
  },

  // 🌺 Ar-Rahman (1–27)
  {
    id: 3,
    suraKey: "rahman",
    surahNumber: 55,
    nameBangla: "আর রহমান",
    nameArabic: "الرحمن",
    totalAyah: 27,
    revelation: "Madani",
    ayahs: [
      {
        ayahNumber: 1,
        arabic: "الرَّحْمَٰنُ",
        banglaUccaron: "আর-রাহমান",
        banglaMeaning: "পরম করুণাময়।",
      },
      {
        ayahNumber: 2,
        arabic: "عَلَّمَ الْقُرْءَانَ",
        banglaUccaron: "আল্লামাল কুরআন",
        banglaMeaning: "তিনি কুরআন শিক্ষা দিয়েছেন।",
      },
      {
        ayahNumber: 3,
        arabic: "خَلَقَ الْإِنْسَانَ",
        banglaUccaron: "খালাকাল ইনসান",
        banglaMeaning: "তিনি মানুষ সৃষ্টি করেছেন।",
      },
      {
        ayahNumber: 4,
        arabic: "عَلَّمَهُ الْبَيَانَ",
        banglaUccaron: "আল্লামাহুল বাইয়ান",
        banglaMeaning: "তিনি তাকে বাকপ্রতিভা শিক্ষা দিয়েছেন।",
      },
      {
        ayahNumber: 5,
        arabic: "الشَّمْسُ وَالْقَمَرُ بِحُسْبَانٍ",
        banglaUccaron: "আশ শামসু ওয়াল কামারু বিহুসবা-ন",
        banglaMeaning: "সূর্য ও চন্দ্র নির্দিষ্ট হিসাবে চলমান।",
      },
      {
        ayahNumber: 6,
        arabic: "وَالنَّجْمُ وَالشَّجَرُ يَسْجُدَانِ",
        banglaUccaron: "ওয়ান নাজমু ওয়াশ শাজারু ইয়াসজুদা-ন",
        banglaMeaning: "তৃণলতা গাছপালা (তাঁরই জন্য) সাজদায় অবনত।",
      },
      {
        ayahNumber: 7,
        arabic: "وَالسَّمَاءَ رَفَعَهَا وَوَضَعَ الْمِيزَانَ",
        banglaUccaron: "ওয়াস সামাআ রাফা'আহা-ওয়া ওয়াদা‘আল মীযান",
        banglaMeaning: "আকাশকে উঁচু করেছেন আর স্থাপন করেছেন (ন্যায়ের) মানদন্ড",
      },
      {
        ayahNumber: 8,
        arabic: "أَلَّا تَطْغَوْا فِي الْمِيزَانِ",
        banglaUccaron: "আল্লা তাতগাওঁফীল মীযান",
        banglaMeaning: "যাতে তোমরা মানদন্ডে সীমালঙ্ঘন না কর।",
      },
      {
        ayahNumber: 9,
        arabic:
          "وَأَقِيمُوا الْوَزْنَ بِالْقِسْطِ وَلَا تُخْسِرُوا الْمِيزَانَ",
        banglaUccaron: "ওয়া আকীমু ওয়াজনা বিল কিসতি ওয়া লা তুখসিরুল মীযান",
        banglaMeaning: "সুবিচারের সঙ্গে ওজন প্রতিষ্ঠা কর আর ওজনে কম দিও না।",
      },
      {
        ayahNumber: 10,
        arabic: "وَالْأَرْضَ وَضَعَهَا لِلْأَنَامِ",
        banglaUccaron: "ওয়াল আরদা ওয়া দা‘আহা-লিলআনাম",
        banglaMeaning: "পৃথিবী সৃষ্টিজগতের জন্য স্থাপন করেছেন।",
      },
      {
        ayahNumber: 11,
        arabic: "فِيهَا فَاكِهَةٌ وَالنَّخْلُ ذَاتُ الْأَكْمَامِ",
        banglaUccaron: "ফীহা-ফা-কিহাতুওঁ ওয়ান নাখলুযা-তুল আকমাম",
        banglaMeaning: "এতে আছে নানান ফলমূল, আর খেজুর গাছ যার ফল আবরণে ঢাকা।",
      },
      {
        ayahNumber: 12,
        arabic: "وَالْحَبُّ ذُو الْعَصْفِ وَالرَّيْحَانُ",
        banglaUccaron: "ওয়াল হাব্বু যুল আসফি ওয়ার রাইহান",
        banglaMeaning: "শস্য ও সুগন্ধি ফুল।",
      },
      {
        ayahNumber: 13,
        arabic: "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ",
        banglaUccaron: "ফাবিআইয়ি আ-লাই রাব্বিকুমা-তুকাজ্জিবা-ন",
        banglaMeaning:
          "অতএব (হে জ্বিন ও মানুষ!) তোমরা তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?",
      },
      {
        ayahNumber: 14,
        arabic: "خَلَقَ الْإِنْسَانَ مِنْ صَلْصَالٍ كَالْفَخَّارِ",
        banglaUccaron: "খালাকাল ইনসা-না মিন সালসা-লিন কাল ফাখখা-র।",
        banglaMeaning:
          "তিনি মানুষ সৃষ্টি করেছেন মাটির পাত্রের মতো শুষ্ক মৃত্তিকা থেকে।",
      },
      {
        ayahNumber: 15,
        arabic: "وَخَلَقَ الْجَانَّ مِنْ مَارِجٍ مِنْ نَارٍ",
        banglaUccaron: "ওয়া খালাকাল জান্না মিম্মা-রিজিমমিন্না-র",
        banglaMeaning: "আর জ্বিনকে সৃষ্টি করেছেন অগ্নিশিখা থেকে।",
      },
      {
        ayahNumber: 16,
        arabic: "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ",
        banglaUccaron: "ফাবিআইয়ি আ-লাই রাব্বিকুমা-তুকাজ্জিবা-ন",
        banglaMeaning:
          "অতএব (হে জ্বিন ও মানুষ!) তোমরা তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?",
      },
      {
        ayahNumber: 17,
        arabic: "رَبُّ الْمَشْرِقَيْنِ وَرَبُّ الْمَغْرِبَيْنِ",
        banglaUccaron: "রাব্বুল মাশরিকাইনি ওয়া রাব্বুল মাগরিবাইন।",
        banglaMeaning: "তিনিই দু’টি উদয় স্থান ও দু’টি অস্তাচলের রব।",
      },
      {
        ayahNumber: 18,
        arabic: "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ",
        banglaUccaron: "ফাবিআইয়ি আ-লাই রাব্বিকুমা-তুকাজ্জিবা-ন",
        banglaMeaning:
          "অতএব (হে জ্বিন ও মানুষ!) তোমরা তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?",
      },
      {
        ayahNumber: 19,
        arabic: "مَرَجَ الْبَحْرَيْنِ يَلْتَقِيَانِ",
        banglaUccaron: "মারাজাল বাহরাইনি ইয়ালতাকিয়া-ন",
        banglaMeaning:
          "তিনি দুই সমুদ্রকে প্রবাহিত করেছেন, যারা একে অপরের সাথে মিলিত হয়।",
      },
      {
        ayahNumber: 20,
        arabic: "بَيْنَهُمَا بَرْزَخٌ لَا يَبْغِيَانِ",
        banglaUccaron: "বাইনাহুমা বারযাখুল লা ইয়াবগিয়া-ন",
        banglaMeaning:
          "উভয়ের মাঝখানে রয়েছে এক অন্তরাল, যা অতিক্রম করতে পারে না।",
      },
      {
        ayahNumber: 21,
        arabic: "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ",
        banglaUccaron: "ফাবিআইয়ি আ-লাই রাব্বিকুমা-তুকাজ্জিবা-ন।",
        banglaMeaning:
          "অতএব (হে জ্বিন ও মানুষ!) তোমরা তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?",
      },
      {
        ayahNumber: 22,
        arabic: "يَخْرُجُ مِنْهُمَا اللُّؤْلُؤُ وَالْمَرْجَانُ",
        banglaUccaron: "ইয়াখরুজু মিনহুমাল লু'লূউ ওয়াল মারজা-ন",
        banglaMeaning: "তাদের হতে বের হয় মুক্তা ও প্রবাল।",
      },
      {
        ayahNumber: 23,
        arabic: "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ",
        banglaUccaron: "ফাবিআইয়ি আ-লাই রাব্বিকুমা-তুকাজ্জিবা-ন।",
        banglaMeaning:
          "অতএব (হে জ্বিন ও মানুষ!) তোমরা তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?",
      },
      {
        ayahNumber: 24,
        arabic: "وَلَهُ الْجَوَاسِمُ الْمَسْخَرَةُ",
        banglaUccaron: "ওয়ালাহুল জাওয়া-রিল মুনশাআ-তুফিল বাহরি কালআ‘লা-ম।",
        banglaMeaning:
          "দরিয়ায় বিচরনশীল পর্বত সম জাহাজসমূহ তাঁরই (নিয়ন্ত্রনাধীন)",
      },
      {
        ayahNumber: 25,
        arabic: "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ",
        banglaUccaron: "ফাবিআইয়ি আ-লাই রাব্বিকুমা-তুকাজ্জিবা-ন।",
        banglaMeaning:
          "অতএব (হে জ্বিন ও মানুষ!) তোমরা তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?",
      },
      {
        ayahNumber: 26,
        arabic: "كُلُّ مَنْ عَلَيْهَا فَانٍ",
        banglaUccaron: "কুল্লাহু মান আ’লাইহা-ফান।",
        banglaMeaning: "পৃথিবীর বুকে যা কিছু আছে সবকিছুই ধ্বংসশীল।",
      },
      {
        ayahNumber: 27,
        arabic: "وَيَبْقَىٰ وَجْهُ رَبِّكَ ذُو الْجَلَالِ وَالْإِكْرَامِ",
        banglaUccaron:
          "ওয়া ইয়াবক্বা ওয়াজহু রাব্বিকা যুল জালালি ওয়াল ইকরা-ম।",
        banglaMeaning: "তোমার রবের মহিমান্বিত সত্তাই চিরস্থায়ী।",
      },
    ],
  },
  {
    id: 4,
    suraKey: "hashr",
    surahNumber: 59,
    nameBangla: "আল হাশর",
    nameArabic: "الحشر",
    totalAyah: 3,
    revelation: "Madani",
    ayahs: [
      {
        ayahNumber: 22,
        arabic:
          "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ ۖ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ ۖ هُوَ الرَّحْمَٰنُ الرَّحِيمُ",
        banglaUccaron:
          "হুওয়াল্লাহুল লা যি লা ইলাহা ইল্লা হুওয়া। আলিমুল গাইবি ওয়াশ শাহাদাতি। হুওয়ার রাহমানুর রাহীম।",
        banglaMeaning:
          "তিনিই আল্লাহ। তিনি ছাড়া কোনো উপাস্য নেই। তিনি অদৃশ্য ও দৃশ্যের পরিজ্ঞাতা। তিনি পরম করুণাময়, পরম দয়াময়।",
      },
      {
        ayahNumber: 23,
        arabic:
          "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ ۖ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ ۚ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ",
        banglaUccaron:
          "হুওয়াল্লাহুল লা যি লা ইলাহা ইল্লা হুওয়া। আল মালিকুল কুদ্দুসুস সালামুল মু'মিনুল মুহাইমিনুল আযীযুল জাব্বারুল মুতাকাব্বির। সুবহানাল্লাহি আম্মা ইউশরিকূন।",
        banglaMeaning:
          "তিনিই আল্লাহ। তিনি ছাড়া কোনো উপাস্য নেই। তিনি মালিক, পবিত্র, শান্তিদাতা, নিরাপত্তাবিধায়ক, রক্ষক, পরাক্রমশালী, প্রবল, মহিমান্বিত। আল্লাহ তাঁর শরিককারীদের কথার থেকে পবিত্র।",
      },
      {
        ayahNumber: 24,
        arabic:
          "هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ ۖ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ ۚ يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
        banglaUccaron:
          "হুওয়াল্লাহুল খালিকুল বারিউল মুসাভবির। লাহুল আসমাউল হুসনা। ইউসাব্বিহু লাহু মা ফিস সামাওয়াতি ওয়াল আরদি। ওয়া হুওয়াল আযীযুল হাকীম।",
        banglaMeaning:
          "তিনিই আল্লাহ। স্রষ্টা, সুসংগঠক, রূপদাতা। সুন্দর নামগুলো তাঁরই। আকাশমণ্ডলী ও পৃথিবীতে যা কিছু আছে তা তাঁরই পবিত্রতা ঘোষণা করে। আর তিনি পরাক্রমশালী, প্রজ্ঞাময়।",
      },
    ],
  },

  {
    id: 5,
    suraKey: "baqara",
    surahNumber: 2,
    nameBangla: "আয়াতুল কুরসি",
    nameArabic: "آية الكرسي",
    totalAyah: 1,
    revelation: "Madani",
    ayahs: [
      {
        ayahNumber: 255,
        arabic:
          "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
        banglaUccaron:
          "আল্লাহু লা ইলাহা ইল্লা হু' আল হাইয়্যু আল কাইয়্যুম। লা তাআখুযুহু সিনাতুন ওয়া লা নাওম। লাহু মা ফিস সামাওয়াতি ওয়া মা ফিল আরদি। মান যাল্লাজী ইয়াশফাআউ ইনদাহু ইল্লা বিইযনিহি। ইয়া'লামু মা বাইনা আইদীহিম ওয়া মা খালফাহুম। ওয়া লা ইউহীতূনা বিশাইইন মিন ইলমিহি ইল্লা বিমা শা'। ওয়াসি'আ কুরসিউহুস সামাওয়াতি ওয়াল আরদ। ওয়া লা ইয়াউদুহু হিফযু হুমা। ওয়া হু'ওয়াল আলিয়্যুল আযীম।",
        banglaMeaning:
          "আল্লাহ, তিনি ছাড়া কোনো ইলাহ নেই, চিরঞ্জীব, স্বয়ংসম্পূর্ণ। তাঁকে নিদ্রা বা ঘুম স্পর্শ করে না। আকাশমণ্ডলী ও পৃথিবীতে যা কিছু আছে তা তাঁরই। তাঁর নিকট কে শাফআআত করতে পারে তাঁর অনুমতি ছাড়া? তিনি জানেন তাদের সামনে ও পিছনে যা আছে। তারা তাঁর জ্ঞানের কোনো কিছুই ধরতে পারে না যা তিনি চান না। তাঁর কুরসি আকাশমণ্ডলী ও পৃথিবীকে ধারণ করেছে এবং তাদের রক্ষা করা তাঁর উপর ভার হয় না। তিনি মহান, মহিমান্বিত।",
      },
    ],
  },

  {
    id: 6,
    suraKey: "duha",
    surahNumber: 93,
    nameBangla: "আদ-দুহা",
    nameArabic: "الضحى",
    totalAyah: 11,
    revelation: "Makki",
    ayahs: [
      {
        ayahNumber: 1,
        arabic: "وَالضُّحَىٰ",
        banglaUccaron: "ওয়াদ দুহা",
        banglaMeaning: "শপথ পূর্বাহ্নের।",
      },
      {
        ayahNumber: 2,
        arabic: "وَاللَّيْلِ إِذَا سَجَىٰ",
        banglaUccaron: "ওয়াল লাইলি ইযা সাজা",
        banglaMeaning: "এবং শপথ রাত্রির যখন তা নিঝুম হয়।",
      },
      {
        ayahNumber: 3,
        arabic: "مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَىٰ",
        banglaUccaron: "মা ওয়াদ্দা'আকা রাব্বুকা ওয়া মা কালা",
        banglaMeaning:
          "তোমার রব তোমাকে পরিত্যাগ করেননি এবং তিনি অসন্তুষ্টও নন।",
      },
      {
        ayahNumber: 4,
        arabic: "وَلَلْآخِرَةُ خَيْرٌ لَكَ مِنَ الْأُولَىٰ",
        banglaUccaron: "ওয়া লাল আখিরাতু খাইরুল লাকা মিনাল উলা",
        banglaMeaning: "এবং অবশ্যই পরকাল তোমার জন্য প্রথম জীবনের চেয়ে উত্তম।",
      },
      {
        ayahNumber: 5,
        arabic: "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰ",
        banglaUccaron: "ওয়া লাসাওফা ইউ'তীকা রাব্বুকা ফাতারযা",
        banglaMeaning:
          "এবং শীঘ্রই তোমার রব তোমাকে প্রদান করবেন যাতে তুমি সন্তুষ্ট হও।",
      },
      {
        ayahNumber: 6,
        arabic: "أَلَمْ يَجِدْكَ يَتِيمًا فَآوَىٰ",
        banglaUccaron: "আলাম ইয়াজিদকা ইয়াতীমান ফাআওয়া",
        banglaMeaning: "তোমাকে তিনি কি অনাথ অবস্থায় পাননি এবং আশ্রয় দেননি?",
      },
      {
        ayahNumber: 7,
        arabic: "وَوَجَدَكَ ضَالًّا فَهَدَىٰ",
        banglaUccaron: "ওয়া ওয়াজাদাকা দাল্লান ফাহাদা",
        banglaMeaning: "এবং তোমাকে পথভ্রষ্ট অবস্থায় পেয়ে পথ দেখাননি?",
      },
      {
        ayahNumber: 8,
        arabic: "وَوَجَدَكَ عَائِلًا فَأَغْنَىٰ",
        banglaUccaron: "ওয়া ওয়াজাদাকা আইলান ফাগনা",
        banglaMeaning: "এবং তোমাকে অভাবগ্রস্ত অবস্থায় পেয়ে ধনী করে দেননি?",
      },
      {
        ayahNumber: 9,
        arabic: "فَأَمَّا الْيَتِيمَ فَلَا تَقْهَرْ",
        banglaUccaron: "ফাম্মাল ইয়াতীমা ফালা তাকহার",
        banglaMeaning: "সুতরাং অনাথের প্রতি কঠোর হয়ো না।",
      },
      {
        ayahNumber: 10,
        arabic: "وَأَمَّا السَّائِلَ فَلَا تَنْهَرْ",
        banglaUccaron: "ওয়াম্মাস সাইলা ফালা তানহার",
        banglaMeaning: "এবং ভিক্ষুকের প্রতি তিরস্কার করো না।",
      },
      {
        ayahNumber: 11,
        arabic: "وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ",
        banglaUccaron: "ওয়াম্মা বিনিমাতি রাব্বিকা ফাহাদ্দিস",
        banglaMeaning: "এবং তোমার রবের নেয়ামত সম্পর্কে ঘোষণা কর।",
      },
    ],
  },

  {
    id: 7,
    suraKey: "inshirah",
    surahNumber: 94,
    nameBangla: "আল ইনশিরাহ",
    nameArabic: "الشرح",
    totalAyah: 8,
    revelation: "Makki",
    ayahs: [
      {
        ayahNumber: 1,
        arabic: "أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ",
        banglaUccaron: "আলাম নাশরাহ লাকা সাদরাক",
        banglaMeaning: "আমি কি তোমার বক্ষ বিস্তৃত করিনি?",
      },
      {
        ayahNumber: 2,
        arabic: "وَوَضَعْنَا عَنْكَ وِزْرَكَ",
        banglaUccaron: "ওয়া ওয়াদা'না আনকা উইজরাক",
        banglaMeaning: "এবং তোমার থেকে তোমার ভার অপসারণ করিনি?",
      },
      {
        ayahNumber: 3,
        arabic: "الَّذِي أَنْقَضَ ظَهْرَكَ",
        banglaUccaron: "আল্লাজী আনকাদা যাহরাক",
        banglaMeaning: "যে তোমার পিঠ ভারাক্রান্ত করেছিল?",
      },
      {
        ayahNumber: 4,
        arabic: "وَرَفَعْنَا لَكَ ذِكْرَكَ",
        banglaUccaron: "ওয়া রাফা'না লাকা যিকরাক",
        banglaMeaning: "এবং আমি তোমার স্মৃতি উচ্চ করেছি?",
      },
      {
        ayahNumber: 5,
        arabic: "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا",
        banglaUccaron: "ফাইন্না মা'আল উসরি ইউসরা",
        banglaMeaning: "নিশ্চয় কষ্টের সাথে স্বস্তি আছে।",
      },
      {
        ayahNumber: 6,
        arabic: "إِنَّ مَعَ الْعُسْرِ يُسْرًا",
        banglaUccaron: "ইন্না মা'আল উসরি ইউসরা",
        banglaMeaning: "নিশ্চয় কষ্টের সাথে স্বস্তি আছে।",
      },
      {
        ayahNumber: 7,
        arabic: "فَإِذَا فَرَغْتَ فَانْصَبْ",
        banglaUccaron: "ফাইযা ফারাগতা ফানসাব",
        banglaMeaning: "সুতরাং যখন তুমি ফুর্তিবান হবে তখন পরিশ্রম কর।",
      },
      {
        ayahNumber: 8,
        arabic: "وَإِلَىٰ رَبِّكَ فَارْغَبْ",
        banglaUccaron: "ওয়া ইলা রাব্বিকা ফারগাব",
        banglaMeaning: "এবং তোমার রবের প্রতি উৎসর্গ কর।",
      },
    ],
  },

  {
    id: 8,
    suraKey: "kafirun",
    surahNumber: 109,
    nameBangla: "আল কাফিরুন",
    nameArabic: "الكافرون",
    totalAyah: 6,
    revelation: "Makki",
    ayahs: [
      {
        ayahNumber: 1,
        arabic: "قُلْ يَا أَيُّهَا الْكَافِرُونَ",
        banglaUccaron: "কুল ইয়া আইয়্যুহাল কাফিরূন",
        banglaMeaning: "বলো, হে কাফিরগণ!",
      },
      {
        ayahNumber: 2,
        arabic: "لَا أَعْبُدُ مَا تَعْبُدُونَ",
        banglaUccaron: "লা আ'বুদু মা তা'বুদূন",
        banglaMeaning: "আমি তা পূজা করি না যা তোমরা পূজা কর।",
      },
      {
        ayahNumber: 3,
        arabic: "وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ",
        banglaUccaron: "ওয়া লা আনতুম আবিদূনা মা আ'বুদু",
        banglaMeaning: "এবং তোমরাও পূজা কর না যা আমি পূজা করি।",
      },
      {
        ayahNumber: 4,
        arabic: "وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ",
        banglaUccaron: "ওয়া লা আনা আবিদুম মা আবাদতুম",
        banglaMeaning: "এবং আমি পূজা করি না যা তোমরা পূজা করেছ।",
      },
      {
        ayahNumber: 5,
        arabic: "وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ",
        banglaUccaron: "ওয়া লা আনতুম আবিদূনা মা আ'বুদু",
        banglaMeaning: "এবং তোমরাও পূজা কর না যা আমি পূজা করি।",
      },
      {
        ayahNumber: 6,
        arabic: "لَكُمْ دِينُكُمْ وَلِيَ دِينِ",
        banglaUccaron: "লাকুম দীনুকুম ওয়ালিয়া দীন",
        banglaMeaning: "তোমাদের জন্য তোমাদের দীন এবং আমার জন্য আমার দীন।",
      },
    ],
  },

  {
    id: 9,
    suraKey: "ikhlus",
    surahNumber: 112,
    nameBangla: "আল ইখলাস",
    nameArabic: "الإخلاص",
    totalAyah: 4,
    revelation: "Makki",
    ayahs: [
      {
        ayahNumber: 1,
        arabic: "قُلْ هُوَ اللَّهُ أَحَدٌ",
        banglaUccaron: "কুল হু'আল্লাহু আহাদ",
        banglaMeaning: "বলো, তিনি আল্লাহ, একক।",
      },
      {
        ayahNumber: 2,
        arabic: "اللَّهُ الصَّمَدُ",
        banglaUccaron: "আল্লাহুস সামাদ",
        banglaMeaning: "আল্লাহ সকলের আশ্রয়।",
      },
      {
        ayahNumber: 3,
        arabic: "لَمْ يَلِدْ وَلَمْ يُولَدْ",
        banglaUccaron: "লাম ইয়ালিদ ওয়া লাম ইউলাদ",
        banglaMeaning: "তিনি কাউকে জন্ম দেননি এবং তাঁকে কেউ জন্ম দেয়নি।",
      },
      {
        ayahNumber: 4,
        arabic: "وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ",
        banglaUccaron: "ওয়া লাম ইয়াকুল লাহু কুফুওয়ান আহাদ",
        banglaMeaning: "এবং তাঁর সমকক্ষ কেউ নেই।",
      },
    ],
  },

  {
    id: 10,
    suraKey: "falaq",
    surahNumber: 113,
    nameBangla: "আল ফালাক",
    nameArabic: "الفلق",
    totalAyah: 5,
    revelation: "Makki",
    ayahs: [
      {
        ayahNumber: 1,
        arabic: "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ",
        banglaUccaron: "কুল আউযুবি রাব্বিল ফালাক",
        banglaMeaning: "বলো, আমি আশ্রয় গ্রহণ করি ভোরের প্রতিপালকের কাছে।",
      },
      {
        ayahNumber: 2,
        arabic: "مِنْ شَرِّ مَا خَلَقَ",
        banglaUccaron: "মিন শাররি মা খালাক",
        banglaMeaning: "তিনি যা সৃষ্টি করেছেন তার অনিষ্ট থেকে।",
      },
      {
        ayahNumber: 3,
        arabic: "وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ",
        banglaUccaron: "ওয়া মিন শাররি গাসিকিই ইযা ওয়াকাব",
        banglaMeaning: "এবং অন্ধকার নিবিড় হয়ে আসার অনিষ্ট থেকে।",
      },
      {
        ayahNumber: 4,
        arabic: "وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ",
        banglaUccaron: "ওয়া মিন শাররিন নাফফাসাতি ফিল উকাদ",
        banglaMeaning: "এবং গ্রন্থিতে ফুঁকমারীদের অনিষ্ট থেকে।",
      },
      {
        ayahNumber: 5,
        arabic: "وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ",
        banglaUccaron: "ওয়া মিন শাররি হাসিদিই ইযা হাসাদ",
        banglaMeaning: "এবং হিংসুকের অনিষ্ট থেকে যখন সে হিংসা করে।",
      },
    ],
  },

  {
    id: 11,
    suraKey: "nas",
    surahNumber: 114,
    nameBangla: "আন নাস",
    nameArabic: "الناس",
    totalAyah: 6,
    revelation: "Makki",
    ayahs: [
      {
        ayahNumber: 1,
        arabic: "قُلْ أَعُوذُ بِرَبِّ النَّاسِ",
        banglaUccaron: "কুল আউযুবি রাব্বিন নাস",
        banglaMeaning: "বলো, আমি আশ্রয় গ্রহণ করি মানুষের প্রতিপালকের কাছে।",
      },
      {
        ayahNumber: 2,
        arabic: "مَلِكِ النَّاسِ",
        banglaUccaron: "মালিকিন নাস",
        banglaMeaning: "মানুষের রাজার কাছে।",
      },
      {
        ayahNumber: 3,
        arabic: "إِلَٰهِ النَّاسِ",
        banglaUccaron: "ইলাহিন নাস",
        banglaMeaning: "মানুষের ইলাহের কাছে।",
      },
      {
        ayahNumber: 4,
        arabic: "مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ",
        banglaUccaron: "মিন শাররিল ওয়াসওয়াসিল খান্নাস",
        banglaMeaning: "মানুষের অনিষ্টকরী ওয়াসওয়াসকারীর অনিষ্ট থেকে।",
      },
      {
        ayahNumber: 5,
        arabic: "الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ",
        banglaUccaron: "আল্লাজী ইউওয়াস্বিসু ফী সুদুরিন নাস",
        banglaMeaning: "যে মানুষের অন্তরে ওয়াসওয়াস করে।",
      },
      {
        ayahNumber: 6,
        arabic: "مِنَ الْجِنَّةِ وَالنَّاسِ",
        banglaUccaron: "মিনাল জিন্নাতি ওয়ান নাস",
        banglaMeaning: "জিন ও মানুষের মধ্য থেকে।",
      },
    ],
  },

  {
    id: 12,
    suraKey: "fatiha",
    surahNumber: 1,
    nameBangla: "আল ফাতিহা",
    nameArabic: "الفاتحة",
    totalAyah: 7,
    revelation: "Makki",
    ayahs: [
      {
        ayahNumber: 1,
        arabic: "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
        banglaUccaron: "বিসমিল্লাহির রাহমানির রাহীম",
        banglaMeaning: "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।",
      },
      {
        ayahNumber: 2,
        arabic: "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
        banglaUccaron: "আলহামদু লিল্লাহি রাব্বিল আলামীন",
        banglaMeaning: "সকল প্রশংসা আল্লাহর জন্য, সকল জগতের রব।",
      },
      {
        ayahNumber: 3,
        arabic: "الرَّحْمَٰنِ الرَّحِيمِ",
        banglaUccaron: "আর রাহমানির রাহীম",
        banglaMeaning: "পরম করুণাময়, অতি দয়ালু।",
      },
      {
        ayahNumber: 4,
        arabic: "مَالِكِ يَوْمِ الدِّينِ",
        banglaUccaron: "মালিকি ইয়াওমিদ্দীন",
        banglaMeaning: "প্রতিদিনের মালিক।",
      },
      {
        ayahNumber: 5,
        arabic: "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ",
        banglaUccaron: "ইয়্যাকা না'বুদু ওয়া ইয়্যাকা নাসতাই'নু",
        banglaMeaning:
          "আমরা একমাত্র তোমারই ইবাদত করি এবং একমাত্র তোমার কাছেই সাহায্য প্রার্থনা করি।",
      },
      {
        ayahNumber: 6,
        arabic: "ٱهْدِنَا ٱلصِّرَٰطَ ٱلْمُسْتَقِيمَ",
        banglaUccaron: "ইহদিনাস সিরাতাল মুসতাকীম",
        banglaMeaning: "আমাদেরকে সরল পথ দেখাও।",
      },
      {
        ayahNumber: 7,
        arabic:
          "صِرَٰطَ ٱلَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ ٱلْمَغْضُوبِ عَلَيْهِمْ وَلَا ٱلضَّآلِّينَ",
        banglaUccaron:
          "সিরাতাল্লাজীনা আনআমতা আলাইহিম গাইরিল মাগদুবি আলাইহিম ওয়া লাদ দাল্লীন",
        banglaMeaning:
          "তাদের পথ যাদের প্রতি তুমি নেয়ামত দান করেছ, যাদের প্রতি গজব নাযিল হয়েছে তাদের পথ নয় এবং যারা পথভ্রষ্ট হয়েছে তাদেরও নয়।",
      },
    ],
  },

  {
    id: 13,
    suraKey: "baqara",
    surahNumber: 2,
    nameBangla: "আল বাকারা",
    nameArabic: "البقرة",
    totalAyah: 5,
    revelation: "Madani",
    ayahs: [
      {
        ayahNumber: 1,
        arabic: "الٓمٓ",
        banglaUccaron: "আলিফ লাম মীম",
        banglaMeaning: "আলিফ-লাম-মীম।",
      },
      {
        ayahNumber: 2,
        arabic: "ذَٰلِكَ الْكِتَابُ لَا رَيْبَ فِيهِ هُدًى لِلْمُتَّقِينَ",
        banglaUccaron: "যালিকাল কিতাবু লা রাইবা ফীহি হুদান লিল মুত্তাক্বীন",
        banglaMeaning:
          "এই বইতে কোনো সন্দেহ নেই, এটি পরহেযারীদের জন্য পথপ্রদর্শক।",
      },
      {
        ayahNumber: 3,
        arabic:
          "الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ",
        banglaUccaron:
          "আল্লাজীনা ইউ'মিনূনা বিল গাইবি ওয়া ইউকীমূনা ছালাতা ওয়া মিম্মা রাযাকনাহুম ইউনফিকূন",
        banglaMeaning:
          "যারা অদৃশ্যে ঈমান আনে, নামায কায়েম করে এবং আমার দেওয়া রিযিক থেকে খরচ করে।",
      },
      {
        ayahNumber: 4,
        arabic:
          "وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ",
        banglaUccaron:
          "ওয়াল্লাজীনা ইউ'মিনূনা বিমা উনযিলা ইলাইকা ওয়া মা উনযিলা মিন কাবলিকা ওয়া বিল আখিরাতি হুম ইউকীনূন",
        banglaMeaning:
          "যারা তোমার প্রতি অবতীর্ণ এবং তোমার পূর্বেও অবতীর্ণ সত্যের প্রতি ঈমান আনে এবং পরকালে দৃঢ়ভাবে বিশ্বাসী।",
      },
      {
        ayahNumber: 5,
        arabic:
          "أُولَٰئِكَ عَلَىٰ هُدًى مِنْ رَبِّهِمْ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ",
        banglaUccaron:
          "উলা-ইকা আলা হুদাম মিন রাব্বিহিম ওয়া উলা-ইকা হুমুল মুফলিহূন",
        banglaMeaning:
          "তারা তাদের রবের পক্ষ থেকে পথপ্রদর্শনের উপর প্রতিষ্ঠিত এবং তারাই সফলকাম।",
      },
    ],
  },
  {
    id: 15,
    suraKey: "nasrum",
    surahNumber: null,
    nameBangla: "নাছরুম",
    nameArabic: "نَصْرُ",
    totalAyah: 4,
    revelation: "Other",
    ayahs: [
      {
        ayahNumber: 1,
        arabic: "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
        banglaUccaron: "বিসমিল্লাহির রাহমানির রাহীম",
        banglaMeaning: "",
      },
      {
        ayahNumber: 2,
        arabic:
          "نَصْرٌ مِّنَ اللَّهِ وَفَتْحٌ قَرِيبٌ ۗ وَبَشِّرِ الْمُؤْمِنِينَ",
        banglaUccaron:
          "নাছরুম মিনাল্লাহি ফাতহুন কারিব ওয়া বাশশিরিল মু’মিনিনা।",
        banglaMeaning: "",
      },
      {
        ayahNumber: 3,
        arabic: "وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِّلْعَالَمِينَ",
        banglaUccaron: "ওয়ামা আরছালনাকা ইল্লা রাহমাতাল্লিল আ-লামিন।",
        banglaMeaning: "",
      },
      {
        ayahNumber: 4,
        arabic:
          "فَآتَاهُمُ اللَّهُ ثَوَابَ الدُّنْيَا وَحُসْنَ ثَوَابِ الْآخِرَةِ ۗ وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ",
        banglaUccaron:
          "ফাআ-তা হুমুল্লা-হু সাওয়াবাত দুনিয়া ওয়া হুসনু সাওয়াবিল আখিরাতি ওয়াল্লাহু ইউহিব্বুল মু’ছিনিন।",
        banglaMeaning: "",
      },
    ],
  },
  {
    id: 16,
    suraKey: "makana",
    surahNumber: null,
    nameBangla: "মাকানা",
    nameArabic: "مَا كَانَ",
    totalAyah: 3,
    revelation: "Other",
    ayahs: [
      {
        ayahNumber: 1,
        arabic: "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
        banglaUccaron: "বিসমিল্লাহির রাহমানির রাহীম",
        banglaMeaning: "",
      },
      {
        ayahNumber: 2,
        arabic:
          "مَّا كَانَ مُحَمَّدٌ أَبَا أَحَدٍ مِّن رِّجَالِكُمْ وَلَٰكিন رَّسُولَ اللَّهِ وَخَاتَمَ النَّبِيِّينَ ۗ وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ عَلِيمًا",
        banglaUccaron:
          "মাকানা মোহাম্মদুন আবা আহাদিম মির রিজালিকুম ওয়া লাকির রাসুলুল্লাহি ওয়া খাতামান নাবীয়্যিন ওয়া কানাল্লাহু বিকুল্লি সাইয়িন আলিমা।",
        banglaMeaning: "",
      },
      {
        ayahNumber: 3,
        arabic:
          "إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا",
        banglaUccaron:
          "ইন্নাল্লাহা ওয়া মালাইকাতাহু ইউছাল্লুনা আলান নাবীয়্যিন ইয়া-আইয়ুহাল্লাজিনা আমানুসাল্লু আলাইহি ওয়া সাল্লিমু তাছলিমা।",
        banglaMeaning: "",
      },
    ],
  },

  {
    id: 17,
    suraKey: "durood_e_taj",
    surahNumber: null,
    nameBangla: "দরুদ-এ-তাজ",
    nameArabic: "درود تاج",
    totalAyah: 1,
    revelation: "Other",
    ayahs: [
      {
        ayahNumber: 1,
        arabic:
          "اَللّٰهُمَّ صَلِّ عَلَىٰ سَيِّدِنَا وَمَوْلَانَا مُحَمَّدٍ صَاحِبِ التَّاجِ وَالْمِعْرَاجِ وَالْبُرَاقِ وَالْعَلَمِ دَافِعِ الْبَلَاءِ وَالْوَبَاءِ وَالْقَحَطِ وَالْمَرَضِ وَالْأَلَمِ اِسْمُهُ مَكْتُوْبٌ مَرْفُوْعٌ مَشْفُوْعٌ مَنْقُوْشٌ فِي اللَّوْحِ وَالْقَلَمِ سَيِّدِ الْعَرَبِ وَالْعَجَمِ جِسْمُهُ مُقَدَّسٌ مُعَطَّرٌ مُطَهَّرٌ مُنَوَّرٌ فِي الْبَيْتِ وَالْحَرَمِ شَمْسِ الضُّحَى بَدْرِ الدُّجَى صَدْرِ الْعُلَى نُوْرِ الْهُدَى كَهْفِ الْوَرَى مِصْبَاحِ الظُّلَمِ جَمِيْلِ الشِّيَمِ شَفِيْعِ الْأُمَمِ صَاحِبِ الْجُوْدِ وَالْكَرَمِ وَاللَّهُ عَاصِمُهُ وَجِبْرِيْلُ خَادِمُهُ وَالْبُرَاقُ مَرْكَبُهُ وَالْمِعْرَاجُ سَفَرُهُ وَسِدْرَةُ الْمُنْتَهَى مَقَامُهُ وَقَابَ قَوْسَيْنِ مَطْلُوْبُهُ وَالْمَطْلُوْبُ مَقْصُوْدُهُ وَالْمَقْصُوْدُ مَوْجُوْدُهُ سَيِّدِ الْمُرْسَلِيْنَ خَاتَمِ النَّبِيّيْنَ شَفِيْعِ الْمُذْنَبِيْنَ اَنِيْسِ الْغَرِيْبِيْنَ رَحْمَةً لِلْعَالَمِيْنَ رَاحَةِ الْعَاشِقِيْنَ مُرَادِ الْمُشْتَاقِيْنَ شَمْسِ الْعَارِفِيْنَ سِرَاجِ السَّالِكِيْنَ مِصْبَاحِ الْمُقَرَّبِيْنَ مُحِبِّ الْفُقَرَاءِ وَالْمَسَاكِيْنَ سَيِّدِ الثَّقْلَيْنِ نَبِيِّ الْحَرَمَيْنِ اِمَامِ الْقِبْلَتَيْنِ وَسِيْلَتِنَا فِي الدَّارَيْنِ صَاحِبِ قَابَ قَوْسَيْنِ مَحْبُوْبِ رَبِّ الْمَشْرِقَيْنِ وَالْمَغْرِبَيْنِ جَدِّ الْحَسেনِ وَالْحُسَيْنِ مَوْلَانَا وَمَوْلَى الثَّقْلَيْنِ اَبِى الْقَاسِمِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ نُوْرٍ مِنْ نُوْرِ اللَّهِ يَا اَيُّهَا الْمُشْتَاقُوْنَ بِنُوْرِ جَمَالِهِ صَلُّوْا عَلَيْهِ وَسَلِّمُوْا تَسْلِيْمًا",
        banglaUccaron:
          "বিসমিল্লাহির রাহমানির রাহীম। আল্লাহুম্মা সাল্লি আলা সাইয়িদিনা ওয়া মাওলানা মুহাম্মাদিন ছাহিবিত তাজি ওয়াল মি’রাজি ওয়াল বুরাকি ওয়াল আলাম। দাফিয়িল বালায়ি ওয়াল ওয়াবায়ি ওয়াল কাহাতি ওয়াল মারাযি ওয়াল আলাম। ইসমুহু মাকতুবুম মারফুউম মাশফুউম মানকুশুন ফিল লাওহি ওয়াল কালাম। সাইয়্যিদিল আরাবি ওয়াল আজাম। জিসমুহু মুকাদ্দাসুম মুআত্তারুম মুতাহহারুম মুনাউ-ওয়ারুম ফিল বাইতি ওয়াল হারাম। শামছিদ্দোহা বাদরিদ্দুজা ছাদরিল উলা নূরিল হুদা কাহফিল ওয়ারা মিছবাহিয যুলাম, জামীলিশ শিয়াম, শাফিয়ীল উমাম। ছাহিবিল যদি ওয়াল কারাম। ওয়াল্লাহু আসিমুহু ওয়া জিবরিলু খাদিমুহু ওয়াল বুরাকু মারকাবুহু ওয়াল মি’রাজু সাফারুহু ওয়া সিদরাতুল মুনতাহা মাকামুহু, ওয়া কাবা কাওসাইনি মাতলুবuহু ওয়াল মাতলুবু মাকসুদুহু ওয়াল মাকসুদু মাওজুদুহু। সাইয়্যিদিল মুরসালীন, খাতিমিন নাবীয়্যিন, শাফী’উল মুজনিবীন, আনিসিল গারিবীন, রাহমাতুল্লিল আলামীন, রাহাতিল আশিকীন, মুরাদিল মুশতাকীন, শামসিল আ’রিফীন, সিরাজিস সালিকীন, মিছবাহিল মুকার-রাবীন, মুহিব্বিল ফুকারা’য়ে ওয়াল গুরাবা’য়ে ওয়াল মাসাকীন, সাইয়্যিদুছ সাকালাইন, নাবিয়্যিল হারামাইন, ইমামিল কিবলাতাইন, ওয়াসীলাতিনা ফিদ দারাইন, ছাহিবিল কাবা কাওসাইনি মাহবুবি রাব্বিল মাশরিকাইনি ওয়াল মাগরিবাইন, জাদ্দিল হাসানি ওয়াল হুসাইন মাওলানা ওয়া মওলাছ্ ছাকালাইন আবিল কাসিম মুহাম্মাদ ইবনি আবদিল্লাহ। নূরিম মিন নূরিল্লাহ। ইয়া আয়্যুহাল মুস্তাকুনা বিনূরী জামালিহী সাল্লু আলাইহি ওয়া আলিহি ওয়া আসহাবিহী ওয়া সাল্লিমু তাসলিমা।",
        banglaMeaning: "",
      },
    ],
  },
];
